[[0, [["Intellectual Passion Short Response", "The Stanford community is deeply curious and driven to learn in and out of the classroom. Reflect on an idea or experience that makes you genuinely excited about learning.*"], ["Roommate Short Response", "Virtually all of Stanford's undergraduates live on campus. Write a note to your future roommate that reveals something about you or that will help your roommate – and us – get to know you better.*"], ["Share Something Meaningful Short Response", "Tell us about something that is meaningful to you and why.*"], ["Societal Challenge Short Response", "What is the most significant challenge that society faces today?"], ["Summer Activities Short Response", "How did you spend your last two summers?"], ["Historical Moment Short Response", "What historical moment or event do you wish you could have witnessed?"], ["Extracurricular Short Response", "Briefly elaborate on one of your extracurricular activities, a job you hold, or responsibilities you have for your family."], ["Stanford Experience Short Response", "Name one thing you are looking forward to experiencing at Stanford."]]], [1, [["Academic Short Response", "Your intellectual life may extend beyond the academic requirements of your particular school. Please use the space below to list additional intellectual activities that you have not mentioned or detailed elsewhere in your application. These could include, but are not limited to, supervised or self-directed projects not done as school work, training experiences, online courses not run by your school, or summer academic or research programs not described elsewhere."], ["Extracurricular Short Response", "Please briefly elaborate on one of your extracurricular activities or work experiences."], ["Select-A-Prompt", "Unusual circumstances in your life"], ["Select-A-Prompt", "Travel, living, or working experiences in your own or other communities"], ["Select-A-Prompt", "What you would want your future college roommate to know about you"], ["Select-A-Prompt", "An intellectual experience (course, project, book, discussion, paper, poetry, or research topic in engineering, mathematics, science or other modes of inquiry) that has meant the most to you"], ["Select-A-Prompt", "How you hope to use your college education"], ["Select-A-Prompt", "A list of books you have read during the past twelve months"], ["Select-A-Prompt", "The Harvard College Honor code declares that we \"hold honesty as the foundation of our community.\" As you consider entering this community that is committed to honesty, please reflect on a time when you or someone you observed had to make a choice about whether to act with integrity and honesty. "], ["Select-A-Prompt", "The mission of Harvard College is to educate our students to be citizens and citizen-leaders for society. What would you do to contribute to the lives of your classmates in advancing this mission? "], ["Select-A-Prompt", "Each year a substantial number of students admitted to Harvard defer their admission for one year or take time off during college. If you decided in the future to choose either option, what would you like to do? "], ["Select-A-Prompt", "Harvard has long recognized the importance of student body diversity of all kinds. We welcome you to write about distinctive aspects of your background, personal development or the intellectual interests you might bring to your Harvard classmates. "]]], [2, [["Why This Major Essay", "Students at Yale have time to explore their academic interests before committing to one or more major fields of study. Many students either modify their original academic direction or change their minds entirely. As of this moment, what academic areas seem to fit your interests or goals most comfortably? Please indicate up to three from the list provided."], ["Why This College Essay", "What is it about Yale that has led you to apply?"], ["Academic Interest Short Response", "Yale’s extensive course offerings and vibrant conversations beyond the classroom encourage students to follow their developing intellectual interests wherever they lead. Tell us about your engagement with a topic or idea that excites you. Why are you drawn to it?"], ["Select-A-Prompt", "What inspires you?\n"], ["Select-A-Prompt", "Yale’s residential colleges regularly host conversations with guests representing a wide range of experiences and accomplishments. What person, past or present, would you invite to speak? What would you ask them to discuss?\n"], ["Select-A-Prompt", "You are teaching a new Yale course. What is it called?\n"], ["Select-A-Prompt", "Yale students embrace the concept of “and” rather than “or,” pursuing arts and sciences, tradition and innovation, defined goals and surprising detours. What is an example of an “and” that you embrace?"], ["Select-A-Prompt", "Reflect on a community to which you feel connected. Why is it meaningful to you?  You may define community however you like."], ["Select-A-Prompt", "Reflect on something that has given you great satisfaction. Why has it been important to you?"]]], [3, [["Extracurricular Short Response", "Briefly elaborate on an activity, organization, work experience, or hobby that has been particularly meaningful to you. (Please respond in about 150 words)"], ["Diversity Short Response", "At Princeton, we value diverse perspectives and the ability to have respectful dialogue about difficult issues. Share a time when you had a conversation with a person or a group of people about a difficult topic. What insight did you gain, and how would you incorporate that knowledge into your thinking in the future?"], ["Community Service Short Response", "Princeton has a longstanding commitment to service and civic engagement. Tell us how your story intersects (or will intersect) with these ideals."], ["Graded Paper Requirement", "Princeton requires you to submit a graded written paper as part of your application. You may submit this material now or any time before the application deadline. If you choose not to upload the required paper at this time, you may mail, e-mail, or upload your paper through the applicant portal. Detailed instructions for our graded paper requirement can be found here."], ["A.B. Applicants or Undecided Applicants Short Response", "As a research institution that also prides itself on its liberal arts curriculum, Princeton allows students to explore areas across the humanities and the arts, the natural sciences, and the social sciences. What academic areas most pique your curiosity, and how do the programs offered at Princeton suit your particular interests? (Please respond in about 250 words)"], ["Engineering Applicants Short Response", "Please describe why you are interested in studying engineering at Princeton. Include any of your experiences in, or exposure to engineering, and how you think the programs offered at the University suit your particular interests. (Please respond in about 250 words)"], ["Select-A-Prompt", "What is a new skill you would like to learn in college?"], ["Select-A-Prompt", "What brings you joy? "], ["Select-A-Prompt", "What song represents the soundtrack of your life at this moment?"]]], [4, [["Diversity Essay", "Describe the world you come from; for example, your family, clubs, school, community, city, or town. How has that world shaped your dreams and aspirations?"], ["Why This Major Essay", "Pick what field of study at MIT appeals to you the most right now, and tell us more about why this field of study appeals to you"], ["Extracurricular Short Response", "We know you lead a busy life, full of activities, many of which are required of you. Tell us about something you do simply for the pleasure of it. "], ["Community Service Short Response", "At MIT, we bring people together to better the lives of others. MIT students work to improve their communities in different ways, from tackling the world’s biggest challenges to being a good friend. Describe one way in which you have contributed to your community, whether in your family, the classroom, your neighborhood, etc."], ["Overcoming Challenges Short Response", "Tell us about the most significant challenge you’ve faced or something important that didn’t go according to plan. How did you manage the situation?"], ["Additional Info Essay", "There is also one final, open-ended, additional-information text box where you can tell us anything else you think we really ought to know."]]], [5, [["Why This College Essay", "Please share with us why you consider Duke a good match for you. Is there something in particular about Duke’s academic or other offerings that attracts you? "], ["Diversity Essay", "Duke University seeks a talented, engaged student body that embodies the wide range of human experience; we believe that the diversity of our students makes our community stronger. If you‘d like to share a perspective you bring or experiences you‘ve had that would help us understand you better, perhaps a community you belong to or your family or cultural background, we encourage you to do so here. Real people are reading your application, and we want to do our best to understand and appreciate the real people applying to Duke."], ["Diversity Essay", "Duke‘s commitment to diversity and inclusion includes sexual orientation, gender identity and gender expression. If you would like to share with us more about your identity in these areas, you can do so here, or use any previous essay prompt you feel is appropriate."]]], [6, [["Why This College Essay", "How does the University of Chicago, as you know it now, satisfy your desire for a particular kind of learning, community, and future? Please address with some specificity your own wishes and how they relate to UChicago."], ["Select-A-Prompt", "What if the moon were made of cheese? Or Neptune made of soap? Pick a celestial object, reimagine its material composition, and explore the implications. Feel free to explore the realms of physics, philosophy, fantasy…the sky is the limit!\n<br />—Inspired by Tate Flicker, Class of 2025"], ["Select-A-Prompt", "What’s so easy about pie?\n<br />—Inspired by Arjun Kalia, Class of 2025"], ["Select-A-Prompt", "In Homer’s Iliad, Helen had a “face that launched a thousand ships.” A millihelen, then, measures the beauty needed to launch one ship. The Sagan unit is used to denote any large quantity (in place of “billions and billions”). A New York Minute measures the period of time between a traffic light turning green and the cab behind you honking. Invent a new unit of measurement. How is it derived? How is it used? What are its equivalents?\n<br />—Inspired by Carina Kane, Class of 2024, and Ishaan Goel, Class of 2025"], ["Select-A-Prompt", "\"There is no such thing as a new idea\" - Mark Twain. Are any pieces of art, literature, philosophy, or technology truly original, or just a different combination of old ideas? Pick something, anything (besides yourself), and explain why it is, or is not, original.\n<br />—Inspired by Haina Lu, Class of 2022"], ["Select-A-Prompt", "It‘s said that history repeats itself. But what about other disciplines? Choose another field (chemistry, philosophy, etc.) and explain how it repeats itself. Explain how it repeats itself.\n<br />—Inspired by Ori Brian, AB’19"], ["Select-A-Prompt", "In the spirit of adventurous inquiry, pose your own question or choose one of our past prompts. Be original, creative, thought provoking. Draw on your best qualities as a writer, thinker, visionary, social critic, sage, citizen of the world, or future citizen of the University of Chicago; take a little risk, and have fun."]]], [7, [["Why This Major Short Response", "Considering the specific undergraduate school you have selected, how will you explore your academic and intellectual interests at the University of Pennsylvania?  For students applying to the coordinated dual-degree and specialized programs, please answer these questions in regard to your single-degree school choice; your interest in the coordinated dual-degree or specialized program may be addressed through the program-specific essay."], ["Why This College Short Response", "At Penn, learning and growth happen outside of the classrooms, too. How will you explore the community at Penn? Consider how this community will help shape your perspective and identity, and how your identity and perspective will help shape this community."], ["Huntsman Program Essay", "The Huntsman Program supports the development of globally-minded scholars who become engaged citizens, creative innovators, and ethical leaders in the public, private, and non-profit sectors in the United States and internationally. What draws you to a dual-degree in business and international studies, and how would you use what you learn to make a contribution to a global issue where business and international affairs intersect?"], ["DMD Program Essay", "Why are you interested in the Digital Media Design (DMD) program at the University of Pennsylvania?"], ["LSM Program Essay", "The LSM program aims to provide students with a fundamental understanding of the life sciences and their management with an eye to identifying, advancing and implementing innovations. What issues would you want to address using the understanding gained from such a program? Note that this essay should be distinct from your single degree essay."], ["M&amp;T Program Essay", "Explain how you will use the M&amp;T program to explore your interest in business, engineering, and the intersection of the two."], ["M&amp;T Program Short Response", "Describe a problem that you solved that showed leadership and creativity."], ["NETS Program Essay", "Describe your interests in modern networked information systems and technologies, such as the Internet, and their impact on society, whether in terms of economics, communication, or the creation of beneficial content for society. Feel free to draw on examples from your own experiences as a user, developer, or student of technology."], [" Nursing and Healthcare Management Essay", " Discuss your interest in nursing and health care management. How might Penn's coordinated dual-degree program in nursing and business help you meet your goals?"], ["VIPER Program Essay", "How do you envision your participation in the Vagelos Integrated Program in Energy Research (VIPER) furthering your interests in energy science and technology? Please include any past experiences (ex. academic, research, or extracurricular) that have led to your interest in the program. Additionally, please indicate why you are interested in pursuing dual degrees in science and engineering and which VIPER majors are most interesting to you at this time."], ["Bio-dental Program Short Response", "Please list pre-dental or pre-medical experience. This experience can include but is not limited to observation in a private practice, dental clinic, or hospital setting; dental assisting; dental laboratory work; dental or medical research, etc. Please include time allotted to each activity, dates of attendance, location, and description of your experience. If you do not have any predental or premedical experience, please indicate what you have done that led you to your decision to enter dentistry."], ["Bio-dental Program Short Response", "List any activities which demonstrate your ability to work with your hands."], ["Bio-dental Program Short Response", "What activities have you performed that demonstrate your ability to work cooperatively with people?"], ["Bio-dental Program Short Response", "Please explain your reasons for selecting a career in dentistry. Please include what interests you the most in dentistry as well as what interests you the least."], ["Bio-dental Program Short Response", "Do you have relatives who are dentists or are in dental school? If so, indicate the name of each relative, his/her relationship to you, the school attended, and the dates attended."]]], [8, [["Additional Info Short Response", "Some schools offer students the opportunity to take national exams in areas such as math and language. These exams include, but are not limited to, AIME, AMC 10, Le Grand Concours, National Spanish Exam, National Latin Exams. If you have taken any of these exams (or any other subject-based national or international examinations), please inform us of the exams and scores you find most meaningful."], ["RISD Dual Degree Essay", "The Brown|RISD Dual Degree Program draws on the complementary strengths of Brown University and Rhode Island School of Design (RISD) to provide students with the opportunity to explore diverse spheres of academic and creative inquiry, culminating in a capstone project that interrelates the content, approaches, and methods from two distinct learning experiences."], ["PLME Short Response", "Committing to a future career as a physician while in high school requires careful consideration and self-reflection. What values and experiences have led you to believe that becoming a doctor in medicine is the right fit for you? "], ["PLME Essay", "How do you envision the Program in Liberal Medical Education (PLME) helping you to meet your academic personal and professional goals as a person and as a physician of the future?"], ["Additional Info Short Response", "Brown’s Open Curriculum allows students to explore broadly while also diving deeply into their academic pursuits. Tell us about any academic interests that excite you, and how you might use the Open Curriculum to pursue them while also embracing topics with which you are unfamiliar."], ["Diversity Short Response", "Brown’s culture fosters a community in which students challenge the ideas of others and have their ideas challenged in return, promoting a deeper and clearer understanding of the complex issues confronting society. This active engagement in dialogue is as present outside the classroom as it is in academic spaces. Tell us about a time you were challenged by a perspective that differed from your own. How did you respond?"], ["Additional Info Short Response", "Brown students care deeply about their work and the world around them. Students find contentment, satisfaction, and meaning in daily interactions and major discoveries. Whether big or small, mundane or spectacular, tell us about something that brings you joy."], ["Select-A-Prompt", "Health care is constantly changing, as it is affected by racial and social disparities, economics, politics, and technology, among other factors. How will you, as a future physician, make a positive impact? "], ["Select-A-Prompt", "How do you feel your personal background provides you with a unique perspective of medicine?"]]], [9, [["Overcoming Challenges Short Response", "Tell us about a time or experience in which you encountered failure."], ["Additional Info Short Response", "Tell us about a life situation, media story, or topic – beyond or outside of a classroom or formal assignment – that has captivated you, inspired your curiosity, and lead you to delve more deeply into learning about a subject on your own."], ["Additional Info Short Response", "Tell us about how you have collaborated with and worked together within a small group of your peers on some task or endeavor in the past, or about how you imagine you will work with your Caltech peers in the future."]]], [10, [["Select-A-Prompt", "REQUIRED:  Olin is a community striving to improve the world and improve people‘s lives through engineering education. What change do you hope to be a part of? Why is this particular change important to you? How do you want to improve the world?"], ["Select-A-Prompt", "Tell us the story of a specific time when you made someone happy. Where were you? What happened? What were you thinking and feeling? What impact did this specific experience of making someone happy have on you?"], ["Select-A-Prompt", "Connect a moment in your life when you felt something strongly (positive or negative) to who you are today. What were the details surrounding this strong emotion? Where were you? What happened? What were you thinking and feeling? And, most importantly, how has that moment informed who you are?\n<br /> "], ["Select-A-Prompt", "Think about all the things we will learn about you throughout your application to Olin, from your application materials and recommendations and through your own words in your other essays. What‘s missing? Share a specific story that tells us something about you that we don‘t yet know.\n<br /> "]]], [11, [["Why This College Essay", "While arguing a Dartmouth-related case before the U.S. Supreme Court in 1818, Daniel Webster, Class of 1801, delivered this memorable line: “It is, sir,…a small college, and yet there are those who love it!” As you seek admission to the Class of 2026, what aspects of the College’s program, community, or campus environment attract your interest?"], ["Select-A-Prompt", "The Hawaiian word mo‘olelo is often translated as \"story\" but it can also refer to history, legend, genealogy, and tradition. Use one of these translations to introduce yourself."], ["Select-A-Prompt", "What excites you?"], ["Select-A-Prompt", "In The Boy Who Harnessed the Wind, William Kamkwamba, Class of 2014, reflects on constructing a windmill from recycled materials to power the electrical appliances in his family‘s Malawian house: \"If you want to make it, all you have to do is try.\" What drives you to create and what do you hope to make or have you already made?"], ["Select-A-Prompt", "Curiosity is a guiding element of Toni Morrison‘s talent as a writer. \"I feel totally curious and alive and in control. And almost...magnificent, when I write,\" she says. Celebrate your curiosity."], ["Select-A-Prompt", "\"Everything changes, everything moves, everything revolves, everything flies and goes away,\" observed Frida Kahlo. Apply Kahlo‘s perspective to your own life."], ["Select-A-Prompt", "In the aftermath of World War II, Dartmouth President John Sloane Dickey, Class of 1929, proclaimed, \"The world‘s troubles are your troubles ... and there is nothing wrong with the world that better humans cannot fix.\" Which of the world‘s \"troubles\" inspires you to act? How might your course of study at Dartmouth prepare you to address it?"]]], [12, [["Why This College Essay", "While other parts of your application give us a sense of who you are, we are also excited to hear more about how you see yourself engaging with the larger Northwestern community."], ["MMSS Program Short Response", "Why MMSS?"], ["MMSS Program Short Response", "Which social science question or problem interests you most?"], ["MMSS Program Short Response", " Describe your extracurricular interests and activities."], ["MMSS Program Short Response", "How did you hear about the MMSS Program?"], ["ISP Program Essay", "Please discuss your interest in science and mathematics."], ["ISP Program Essay", "Briefly discuss your educational and career goals."], ["ISP Program Essay", "Why is ISP interesting to you?"], ["ISP Program Essay", "How did you learn about ISP?"], ["ISP Program Essay", "Describe any projects, special courses, jobs, or awards of yours that are related to science or mathematics."]]], [13, [["Why This Major Essay", "Why are you drawn to studying the major you have selected? Please discuss how your interests and related experiences have influenced your choice. Specifically, how will an education from the College of Agriculture and Life Sciences (CALS) and Cornell University help you achieve your academic goals?"], ["Why This Major Essay", "What is your “thing”? What energizes you or engages you so deeply that you lose track of time? Everyone has different passions, obsessions, quirks, inspirations. What are yours?"], ["Why This Major Essay", "Students in Arts and Sciences embrace the opportunity to delve into multifaceted academic interests, embodying in 21st century terms Ezra Cornell’s “any person…any study” founding vision. Tell us about the areas of study you are excited to explore, and specifically why you wish to pursue them in our College."], ["Why This Major Essay", "What kind of a business student are you? Using your personal, academic, or volunteer/work experiences, describe the topics or issues that you care about and why they are important to you. Your response should convey how your interests align with the school(s) to which you are applying within the Cornell SC Johnson College of Business (Dyson School and/or School of Hotel Administration)."], ["Why This Major Essay", "How has your decision to apply to the College of Human Ecology been influenced by your related experiences? How will your choice of major impact your goals and plans for the future?"], ["Why This Major Essay", "Using your personal, academic, or volunteer/work experiences, describe the topics or issues that you care about and why they are important to you. Your response should show us that your interests align with the ILR School."], ["Select-A-Prompt", "Engineering is inherently collaborative. What does collaboration mean to you? What strengths do you bring to the collaborative process?"], ["Select-A-Prompt", "For you, what makes Cornell Engineering special? Why do you want to attend Cornell Engineering?"], ["Select-A-Prompt", "Diversity in all definitional forms is intrinsic to excellence in engineering. Indeed, devising the best engineered solutions to complex problems is often achieved by drawing from the diverse ingenuity of people from broadly different backgrounds, lived experiences, and identities. How do you see yourself contributing to the diversity and inclusion of the Cornell Engineering community? What is the unique voice you would bring to the Cornell Engineering community?"]]], [14, [["Academic Book Short Response", "List the titles of the required readings from academic courses that you enjoyed most during secondary/high school. "], ["For Fun Book Short Response", "List the titles of the books, essays, poetry, short stories or plays you read outside of academic courses that you enjoyed most during secondary/high school."], ["Media Short Response", "We’re interested in learning about some of the ways that you explore your interests. List some resources and outlets that you enjoy, including but not limited to websites, publications,  journals, podcasts, social media accounts, lectures, museums, movies, music, or other content with which you regularly engage."], ["Diversity Short Response", "A hallmark of the Columbia experience is being able to learn and live in a community with a wide range of perspectives. How do you or would you learn from and contribute to diverse, collaborative communities? "], ["Why This College Short Response", "Why are you interested in attending Columbia University? We encourage you to consider the aspect(s) that you find unique and compelling about Columbia."], ["Engineering Majors Short Response", "For applicants to Columbia Engineering, please tell us what from your current and past experiences (either academic or personal) attracts you specifically to the areas of study that you previously noted in the application."], ["Trinity College Dublin Dual BA Program Essay", "Describe how your experiences, both personal and academic, have shaped your decision to pursue the Dual BA Program. Why is an international academic\n<br />experience important to you as you consider the ways in which it may influence your future?"], ["Sciences Po Dual BA Program Essay", "Describe how your experiences, both personal and academic, have shaped your decision to pursue the Dual BA Program. Why is an international academic\n<br />experience important to you as you consider the ways in which it may influence your future?"]]], [15, [["Why This Major Short Response", "Please explain why you wish to study in the academic areas you selected above."], ["Why This College Short Response", "Based upon your exploration of Rice University, what elements of the Rice experience appeal to you?"], ["Rice/Baylor Medical Scholars Short Response", "What aspirations, experiences or relationships have motivated you to study in the eight-year Rice/Baylor Medical Scholars Program?"], ["Rice/Baylor Medical Scholars Short Response", "Outside of academics, what do you enjoy doing most?"], ["Rice/Baylor Medical Scholars Short Response", "Describe the most difficult adversity you have faced, and describe how you dealt with it."], ["Architecture Major Short Response", "Why are you determined to study architecture? Could you please elaborate on your past experiences and how they have motivated you to apply to Rice University and the School of Architecture in particular?"], ["Architecture Major Short Response", "Please expand on relevant experiences and motivations outside of your academic trajectory that have inspired you to study architecture, focusing on aspects that are not accommodated by other prompts in the application."]]], [16, [["Additional Info Essay", "Williams does not require a writing supplement. However, students who are interested in submitting an example of their written work have the option of sharing an academic paper completed within the last year, ideally 3-5 pages in length. The paper does not need to be graded, and can be creative or analytical. Please do not submit lab reports. If submitting this optional paper, please include a description of the assignment or prompt."]]], [17, [["Extracurricular Short Response", "Please briefly elaborate on one of your extracurricular activities or work experiences."]]], [18, [["Additional Info Essay", "If there are aspects of your identity that you feel are not captured elsewhere in this application, please provide that information below. "], ["This or That Short Response", "Marvel or DC? Pepsi or Coke? Instagram or TikTok? What‘s your favorite \"this or that\" (you are not restricted to these three examples), and which side do you choose?"], ["Potato Short Response", "What‘s your favorite way to eat a potato?"], ["Favorite Song Short Response", "You‘re relaxing on a Friday night. Suddenly, your favorite song pops into your head. What is it?"], ["Community Service Short Response", "According to our Board of Trustees, \"Institutions such as Pomona College should prepare their graduates to lead lives of creative leadership and exemplary service.\" How do you hope to use the knowledge you will gain in college to impact something greater than yourself, such as your family, neighborhood, community, city or society? "], ["Select-A-Prompt", "We believe that everyone has something to contribute and receive from a diverse community. Why is belonging to a diverse and inclusive college community important to you?\n"], ["Select-A-Prompt", "Advancing diversity and inclusion (D&amp;I) can be hard work and a continuous learning process. Tell us about how you have either recently championed D&amp;I or how you plan to maintain a deep commitment to D&amp;I in college."]]], [19, [["&quot;The Offer&quot; Short Response", "Generations of students have found connection and meaning in Bowdoin’s “The Offer of the College,” written in 1906 by Bowdoin President William DeWitt Hyde.\n<br />“To be at home in all lands and all ages;\n<br />to count Nature a familiar acquaintance,\n<br />and Art an intimate friend;\n<br />to gain a standard for the appreciation of others’ work\n<br />and the criticism of your own;\n<br />to carry the keys of the world’s library in your pocket,\n<br />and feel its resources behind you in whatever task you undertake;\n<br />to make hosts of friends…who are to be leaders in all walks of life;\n<br />to lose yourself in generous enthusiasms and cooperate with others for common ends”\n<br />– William DeWitt Hyde, 7th President of Bowdoin College, 1906"]]], [20, [["Personal Identity Short Response", "Founded in the spirit of exploration and discovery, Johns Hopkins University encourages students to share their perspectives, develop their interests, and pursue new experiences."]]], [21, [["Why This College Short Response", "The founder of the Congregation of Holy Cross, Blessed Basil Moreau, wrote, “We shall always place education side by side with instruction; the mind will not be cultivated at the expense of the heart.” How do you hope a Notre Dame education and experience will transform your mind and heart?"], ["Select-A-Prompt", "During the spring semester, Notre Dame faculty gave 3-Minute Lightning Talks on exciting topics within their fields of expertise. While you don‘t have a Ph.D. yet, we bet you‘re developing an expertise in something. If you were giving a Lightning Talk, what topic (academic or not) would you choose?"], ["Select-A-Prompt", "There is a story or meaning behind every name or nickname—both those we’re given and those that we choose. What is meaningful to you about your name?"], ["Select-A-Prompt", "What would you fight for?"]]], [22, [["Why This College Short Response", "Please tell us what you are interested in studying at WashU and why."], ["Beyond Boundaries Program Short Response", "Many of our students broadly explore the connections across WashU’s five undergraduate divisions and three graduate schools and engage with the community before declaring a major. The Beyond Boundaries Program equips students with a set of tools to critically understand and make a difference in a complicated world where challenges do not come pre-packaged as territory of a single discipline. Tell us what great challenge you might want to understand and tackle leveraging two or more of WashU‘s schools and how you would pursue an interdisciplinary path of study that explores that challenge or an aspect of that challenge in a unique and innovative way."], ["Joint Program in Business and Computer Science Short Response", "Students in the Joint Program in Business and Computer Science will be equipped with the fundamental knowledge and perspectives of computer science and business and will have unique opportunities to converge these two disciplines.\n<br />This is a distinctive degree program that captures the intersection of business and computer science and the growing demand for people with this special and sought-after skillset. Graduates of the program will able to pursue careers in technology, data analytics, finance, consulting and business development, to name a few.\n<br />Tell us how you would use this combined degree to explore the intersection of these two disciplines?"], ["Danforth Scholars Program Short Response", "The Danforth Scholars Program is looking for students with a strong commitment to community and demonstrated initiative in leadership and service. Please share an example of your personal experience as a leader that would clarify why you would be a good fit for this community of scholars. "], ["Danforth Scholars Program Short Response", "Write an essay on the following: What matters to you?"], ["Ervin Scholars Program Short Response", "Describe a high school or community activity in which you have taken initiative. What were the challenges and outcomes? What did you learn?"], ["Ervin Scholars Program Short Response", "Review the biography of Dr. John B. Ervin and the four Program Pillars. How have you demonstrated your commitment to the ideals of the Program? Please provide 1-2 specific examples."], ["Rodriguez Scholars Program Short Response", "Describe a high school or community activity in which you have taken initiative. What were the challenges and outcomes? What did you learn?"]]], [23, [["Diversity Short Response", "At Amherst we know that identity is more than checkboxes. If you would like to share more about your identity, background, family, culture or community, please tell us more here."], ["Extracurricular Short Response", "If you have engaged in significant research in the natural sciences, mathematics, computer science, social sciences or humanities that was undertaken independently of your high school curriculum, please provide a brief description of the research project:"], ["Extracurricular Short Response", "Please briefly elaborate on an extracurricular activity or work experience of particular significance to you."], ["Select-A-Prompt", "Option A: Please respond to one of the following quotations in an essay of not more than 300 words. It is not necessary to research, read, or refer to the texts from which these quotations are taken; we are looking for original, personal responses to these short excerpts. Remember that your essay should be personal in nature and not simply an argumentative essay. "], ["Select-A-Prompt", "Option B: Please submit a graded paper from your junior or senior year that best represents your writing skills and analytical abilities. We are particularly interested in your ability to construct a tightly reasoned, persuasive argument that calls upon literary, sociological or historical evidence. You should NOT submit a laboratory report, journal entry, creative writing sample or in-class essay. If you have submitted an analytical essay in response to the \"essay topic of your choice\" prompt in the Common Application writing section, you should NOT select Option B. Instead, you should respond to one of the four quotation prompts in Option A."], ["Select-A-Prompt", "Option C: If you are/were an applicant to Amherst‘s Access to Amherst (A2A) program, you may use your A2A application essay in satisfaction of our Writing Supplement requirement. If you would like to do so, please select Option C. However, if you would prefer not to use your A2A essay for this purpose and you want to submit a different writing supplement, select either Option A or Option B. [Please note that Option C is available only to applicants to Amherst‘s A2A program. Non-A2A applicants must choose either Option A or Option B.] "]]], [24, [["Why This College Short Response", "When choosing a college community, you are choosing an intellectual community and a place where you believe that you can live, learn, and flourish. We know that there are more than 100 reasons to choose Wellesley, but it‘s a good place to start. Visit the Wellesley 100 and select two items that attract, inspire, or energize you. Have fun with this and use this opportunity to reflect personally on what items appeal to you most and why. Please limit your response to the Wellesley College essay to two well-developed paragraphs."]]], [25, [["Why This College Short Response", "Why do you want to attend CMC?"], ["Why This Major Short Response", "For the purpose of this essay prompt, pick one FHS or FWS seminar topic to study at CMC. What part of your personal experience—or your desire to know more about an area outside of your experience—best explains your seminar choice?"]]], [26, [["Why This Major Short Response", "Describe how you plan to pursue your academic interests and why you want to explore them at USC specifically. Please feel free to address your first- and second-choice major selections."], ["Additional Info Short Response", "Starting with the beginning of high school/secondary school, if you have had a gap where you were not enrolled in school during a fall or spring term, please address this gap in your educational history. You do not need to address a summer break."], ["Describe Yourself Short Response", "Describe yourself in three words. \n"], ["Favorite Snack Short Response", "What is your favorite snack?"], ["Best Movie Short Response", "Best movie of all time:"], ["Dream Job Short Response", "Dream job:"], ["Theme Song Short Response", "If your life had a theme song, what would it be?"], ["Dream Trip Short Response", "Dream trip:"], ["TV Show Short Response", "What TV show will you binge watch next?"], ["Fictional Character Short Response", "Which well-known person or fictional character would be your ideal roommate?"], ["Favorite Book Short Response", "Favorite book:"], ["Teach a Class Short Response", "If you could teach a class on any topic, what would it be?"], ["Select-A-Prompt", "USC believes that one learns best when interacting with people of different backgrounds, experiences and perspectives. Tell us about a time you were exposed to a new idea or when your beliefs were challenged by another point of view. Please discuss the significance of the experience and its effect on you."], ["Select-A-Prompt", "USC faculty place an emphasis on interdisciplinary academic opportunities. Describe something outside of your intended academic focus about which you are interested in learning."], ["Select-A-Prompt", "What is something about yourself that is essential to understanding you?"], ["Select-A-Prompt", "The word \"education\" can take on a variety of meanings. To some, receiving a high school or college diploma is the ultimate mark of being \"educated,\" while others take a different view. Looking past receiving a diploma, what does it mean to you personally to be \"educated\"? What standards will you put in place to define whether or not you‘ve obtained a great education?"], ["Select-A-Prompt", "Many of us have at least one issue or passion that we care deeply about -- a topic on which we would love to share our opinions and insights in hopes of sparking intense interest and continued conversation. If you had ten minutes and the attention of a million people, what would your talk be about?"]]], [27, [["Why This College Short Response", "Which aspects of the Tufts undergraduate experience prompt your application? In short, ‘Why Tufts?’ "], ["SMFA BFA in Studio Art Program Short Response", "Art has the power to disrupt our preconceptions, shape public discourse, and imagine new ways of being in the world. What are the ideas you’d like to explore in your work?"], ["5 year combined BFA + BA/BS Program Short Response", "Art has the power to disrupt our preconceptions, shape public discourse, and imagine new ways of being in the world. What are the ideas you’d like to explore in your work?"], ["Select-A-Prompt", "It’s cool to love learning. What excites your intellectual curiosity?"], ["Select-A-Prompt", "How have the environments or experiences of your upbringing – your family, home, neighborhood, or community – shaped the person you are today?"], ["Select-A-Prompt", "Where are you on your journey of engaging with or fighting for social justice?"]]], [28, [["Select-A-Prompt", "Swarthmore students’ worldviews are often forged by their prior experiences and exposure to ideas and values. Our students are often mentored, supported, and developed by their immediate context—in their neighborhoods, communities of faith, families, and classrooms. Reflect on what elements of your home, school, or community have shaped you or positively impacted you. How have you grown or changed because of the influence of your community?"], ["Select-A-Prompt", "We are inspired by students who are flexible in their approach to learning, who are comfortable with experimentation, and who are willing to take intellectual risks that move them out of their comfort zone. Reflect on a time that you were intellectually challenged, inspired, or took an intellectual risk—inside or outside of the classroom. How has that experience shaped you, and what questions still linger?"], ["Select-A-Prompt", "Why are you interested in applying to and attending Swarthmore?"]]], [29, [["Extracurricular Essay", "Briefly (approximately one-half page, single-spaced) discuss the significance to you of the school or summer activity in which you have been most involved."], ["Additional Info Essay", "As Georgetown is a diverse community, the Admissions Committee would like to know more about you in your own words. Please submit a brief essay, either personal or creative, which you feel best describes you. "], ["Georgetown College Essay", "What does it mean to you to be educated? How might Georgetown College help youachieve this aim? (Applicants to the Sciences and Mathematics or the Faculty of Languages and Linguistics should address their chosen course of study.)"], ["School of Nursing and Health Studies Essay", "Describe the factors that have influenced your interest in studying health care.  Please specifically address your intended major (Global Health, Health Care Management &amp; Policy, Human Science,or Nursing)."], ["Walsh School of Foreign Service Essay", "The Walsh School of Foreign Service was founded more than a century ago to prepare generations of leaders to solve global problems.  What is motivating you to dedicate your undergraduate studies to a future in service to the world?"], ["McDonough School of Business Essay", "The McDonough School of Business is a national and global leader in providing graduates with essential ethical, analytical, financial and global perspectives.  Please discuss your motivations for studying business at Georgetown."]]], [30, [["Community Service Short Response", "Everyone belongs to many different communities and/or groups defined by (among other things) shared geography, religion, ethnicity, income, cuisine, interest, race, ideology, or intellectual heritage. Choose one of the communities to which you belong, and describe that community and your place within it. "], ["Why This Major Essay", "Describe the unique qualities that attract you to the specific undergraduate College or School (including preferred admission and dual degree programs) to which you are applying at the University of Michigan. How would that curriculum support your interests?"], ["Ross School of Business Essay", "Choose a current event or issue in your community and discuss the business implications. Propose a solution that incorporates business principles or practices. The review panel will look for creativity, drawing connections, and originality. Your response should be limited to approximately 500 words."], ["Ross School of Business Short Response", "Upload an artifact that represents something significant about your life and shows how you’ve put learning into action. This could be related to something inside or outside of the classroom (like an extracurricular accomplishment you’re particularly proud of). The goal is to give you the chance to showcase a unique aspect of yourself.\n<br /> \n<br />Artifact examples can include a: "]]], [32, [["Why This College Short Response", "Please describe how you have familiarized yourself with Washington and Lee University and what aspects of W&amp;L‘s community are most exciting to you."], ["Extracurricular Short Response", "Please describe an aspect of your life outside of school that is important to you, such as an extracurricular activity, a job or a family responsibility. How does your involvement impact you and those around you?"], ["Select-A-Prompt", "\"To promote literature in this rising empire and to encourage the arts, have ever been amongst the warmest wishes of my heart.\" (George Washington, 1798, first president of the United States and first major benefactor of Washington and Lee University). Describe a work of art that has influenced you, and discuss the impact it has had on you."], ["Select-A-Prompt", "In mathematics, the shortest distance between two points on a flat surface is a straight line. While geometry is predictable, sometimes day to day life is not. Reflect on a time when your path was not as simple or direct as anticipated. How did you manage, and what did you learn?"], ["Select-A-Prompt", "We live in a world in which much of our self-representation is curated online via short-lived social media ‘stories‘ and disappearing photos. What photo or other representation of yourself is authentically you? What does it say about your growth into the person you are today, and the person you want to become? Please use only the words in your essay to address this question. Do not include photographs or other materials in your answer."], ["Select-A-Prompt", "W&amp;L‘s Spring Term is a four week, intensive experience during which students take only one course, allowing for undivided attention to the subject matter. Spring Term courses are known for innovative pedagogy, interdisciplinary scholarship, travel, and field work in diverse settings. If you could design a Spring Term course, what would you propose, and why would you choose to pursue that topic?"], ["Select-A-Prompt", "In his October, 1963, A Talk to Teachers, James Baldwin said \"...the whole process of education occurs within a social framework and is designed to perpetuate the aims of society.\" Yet, as he aptly notes, \"the paradox of education is precisely this -- that as one begins to become conscious one begins to examine the society in which he is being educated.\" Baldwin suggests that the purpose of education is to teach us to think for ourselves, to question -- and change -- the \"framework\" that we have come to understand and accept. What norms of your home or community have you become conscious of during your time in high school, and how would you like to use that knowledge to make it a better place?"]]], [33, [["Why This College Essay", "Tell us about a topic or issue that sparks your curiosity and gets you intellectually excited. How do you think the environment at Haverford, including the framework of the Honor Code, would foster your continued intellectual growth?"], ["Why This College Essay", "Please tell us what motivated you to apply to Haverford and what excites you most as you imagine your Haverford experience."]]], [34, [["Engineering Essay", "The Cooper Union is a small, highly specialized, and academically challenging school in New York City. Beyond these traits, what other aspects of the school excite you and how might you contribute to, and benefit from, our learning community."], ["Engineering Essay", "Why are you interested in pursuing your chosen major (e.g., Chemical, Civil, Electrical, General or Mechanical Engineering) and how do you see yourself applying your degree?"], ["Engineering Essay", "If you were to give a 45 minute lecture on a specific topic to an audience, similar to a TED talk, what would your topic be and why?"]]], [35, [["Why This Major Essay", "What academic areas are you interested in exploring in college?"], ["Select-A-Prompt", "Reflect on a personal experience where you intentionally expanded your cultural awareness."], ["Select-A-Prompt", "When was the last time you questioned something you had thought to be true?"], ["Select-A-Prompt", "If you could witness a historic event (past, present or future) first-hand, what would it be, and why?"], ["Select-A-Prompt", "Share a time when you were awestruck.\n"], ["Select-A-Prompt", "Which book, character, song, monologue, or piece of work (fiction or non-fiction) seems made for you? Why?"]]], [37, [["Additional Info Short Response", "Anything missing? Do you want to share more with us? If so, use this space to fill any gaps you think would assist us in reviewing your application."], ["Select-A-Prompt", "I am empowered by individuals who... OR"], ["Select-A-Prompt", "I value community because... OR"], ["Select-A-Prompt", "I want to better my world by..."]]], [38, [["Why This Major Essay", "Tell us more about why you are interested in this program."], ["Why This College Short Response", "We would like to know more about your interest in NYU. What motivated you to apply to NYU? Why have you applied or expressed interest in a particular campus, school, college, program, and or area of study? If you have applied to more than one, please also tell us why you are interested in these additional areas of study or campuses. We want to understand - Why NYU?"], ["Criminal Activity Essay", "Only required if you were responsible of disciplinary violation or a criminal offense. If you answer yes to either or both of the two questions above, please provide NYU’s special admissions committee a written explanation about what happened, including details regarding the charges of which you were convicted or found guilty and the punishment you received, including fines, community service, jail, prison, suspension, expulsion etc. The committee is particularly interested in learning more about the process of change you have undergone after these events and what you may have learned from these experiences."]]], [40, [["Why This College Short Response", "There are just under 4,000 4-year colleges and universities in the United States. Being as specific as possible, what interests you most about Davidson College?"], ["Passion Short Response", "Davidson encourages students to explore curiosities in and out of the classroom. What is a topic, activity or idea that excites you? Tell us why. Examples may include hobbies, books, interactions, music, podcasts, movies, etc."]]], [41, [["Why This College Essay", "Why are you applying to Vassar?"]]], [42, [["Tradition Short Response", "One family tradition I cherish:"], ["I Believe Short Response", "This I believe:"], ["Quality I Admire Short Response", "The quality I most admire in myself:"], ["Protagonist Short Response", "One protagonist I identify with:"], ["Service-Based Gap Year Short Response", "Why do you want to take a service-based Gap Year before entering Carolina and in what ways are you hoping to grow during this time?"], ["Why This College Short Response", "Please submit a short essay (250 words or fewer) that describes your academic interests and the ways you believe Honors Carolina can help you pursue them."], ["Select-A-Prompt", "Describe a peer you see as a community builder. What actions has that peer taken? How has their work made a difference in your life?"], ["Select-A-Prompt", "Describe an aspect of your identity (for example, your religion, culture, race, sexual or gender identity, affinity group, etc.). How has this aspect of your identity shaped your life experiences thus far?"], ["Select-A-Prompt", "If you could change one thing to better your community, what would it be? Why is it important and how would you contribute to this change?"], ["Select-A-Prompt", "Former UNC-Chapel Hill employee, community service member, and civil rights activist Esphur Foster once said “We are nothing without our history.” Her words are memorialized on the Northside Neighborhood Freedom Fighters monument (https://jacksoncenter.info/the-northside-gateway/). How does history shape who you are?"]]], [43, [["List of Books Short Response", "List five books you’ve read that intrigued you. (you’ll need to indicate the title, author, and whether it was required)"], ["Top 10 List Short Response", "Give us your Top Ten list. There is a space to name the Theme of the list, and 10 separate lines for each item, with a character limit of 100 each."], ["Why This College Essay", "How did you become interested in Wake Forest University? Feel free to tell us about any contact that you had with Wake Forest that was important to you."], ["Impactful Book Short Response", "Explain how a book you’ve read has helped you to understand the world’s complexity."], ["Intellectual Curiosity Short Response", "Tell us more about the topic that most engages your intellectual curiosity."]]], [45, [["Why This Major Essay", "Most students choose their intended major or area of study based on a passion or inspiration that’s developed over time – what passion or inspiration led you to choose this area of study?"], ["Successful College Experience Short Response", "Many students pursue college for a specific degree, career opportunity or personal goal. Whichever it may be, learning will be critical to achieve your ultimate goal. As you think ahead to the process of learning during your college years, how will you define a successful college experience?"], ["Additional Info Essay", "Consider your application as a whole. What do you personally want to emphasize about your application for the admission committee’s consideration? Highlight something that’s important to you or something you haven’t had a chance to share. Tell us, don’t show us (no websites please)."], ["Test Score Short Response", "When it comes to test scores, it’s helpful for us to understand your individual context. If you’d like, please share any information about your standardized test scores or inability to take standardized tests. This is an optional question that we’ll only use as additional context for consideration. "]]], [46, [["Why This College Short Response", "What factors encouraged your decision to apply to Barnard College, and why do you think the college would be a good match for you?"], ["Bold Questions Short Response", "At Barnard, academic inquiry starts with bold questions. What are some of the bold questions you have pondered that get you excited and why do they interest you? Tell us how you would explore these questions at Barnard."], ["Conversation with Figure Short Response", "Pick one woman — a historical figure, fictitious character, or modern individual — to converse with for an hour and explain your choice. Why does this person intrigue you? What would you talk about? What questions would you ask them?"], ["Additional Info Short Response", "Have you ever been found responsible for a disciplinary violation at any educational institution you have attended from the 9th grade (or the international equivalent) forward, whether related to academic or behavioral misconduct that resulted in a disciplinary action? If yes, please explain the circumstances."], ["Deferral Short Response", "In the box below, please indicate if you are considering a deferral to Fall 2023 if you are offered admission for Fall 2022. Please note that admitted students will be required to submit a deferral request form with a detailed outline of their plans by February 2022 for students admitted through Early Decision and by April 2022 for students admitted through Regular Decision."], ["Science Pathway Scholars Program Short Response", "Applicants to the Science Pathways Scholars Program for Underrepresented Minority and First-Generation Students: The Science Pathways Scholars Program (SP)2 aims to support underrepresented students of color and first-generation students as they pursue careers in science research. Please discuss your interest in science research and future career goals. You may choose to reflect on past experiences or projects, role models, or ideas for research that you would like to explore. "]]], [48, [["Inspiring Piece Short Response", "What work of art, music, science, mathematics, literature, or other media has surprised, unsettled, or inspired you, and in what way?"], ["Engineering Majors Short Response", "Describe an engineering feat that serves the common good and why it inspires you to study engineering."], ["Architecture Majors Short Response", "Describe a significant experience that deepened your interest in studying in the School of Architecture."], ["Nursing Majors Short Response", "Describe a health care-related experience or another significant interaction that deepened your interest in studying Nursing."], ["Kinesiology Majors Short Response", "Discuss an experience that led you to apply to the kinesiology major."], ["Select-A-Prompt", "What‘s your favorite word and why?"], ["Select-A-Prompt", "We are a community with quirks, both in language and in traditions. Describe one of your quirks and why it is part of who you are."], ["Select-A-Prompt", "Student self-governance, which encourages student investment and initiative, is a hallmark of the UVA culture. In her fourth year at UVA, Laura Nelson was inspired to create Flash Seminars, one-time classes which facilitate high-energy discussion about thought-provoking topics outside of traditional coursework. If you created a Flash Seminar, what idea would you explore and why?"], ["Select-A-Prompt", "UVA students paint messages on Beta Bridge when they want to share information with our community. What would you paint on Beta Bridge and why is this your message?"], ["Select-A-Prompt", "Rita Dove, UVA English professor and former U.S. Poet Laureate, once said in an interview that “…there are times in life when, instead of complaining, you do something about your complaints.” Describe a time when, instead of complaining, you took action for the greater good."]]], [50, [["Why This College Essay", "What influenced you to apply to Harvey Mudd College? What about the HMC curriculum and community appeals to you? Please limit your response to 500 words."], ["HSA Class Short Response", "Many students choose HMC because they don’t want to give up their interests in the Humanities, Social Sciences and the Arts – or HSA as we call it at HMC. Briefly (in 100 words or less) describe what you‘d like to learn about in your dream HSA class."]]], [51, [["Why This Major Essay", "With the understanding that some students will change colleges at Lehigh after the first year, please briefly describe why you chose to apply to the first-choice college or major that you listed above."], ["Why This College Essay", "How did you first learn about Lehigh University and what motivated you to apply?"], ["Community Service Short Response", "A compelling characteristic of Lehigh’s community is that our students want to be actively engaged in their learning, their community, and the world. Our students look to make a difference and have a real-world impact. We expect our community to challenge your viewpoint, your naturalized assumptions, and the way that you see the world around you. Lehigh University is committed to being an anti-racist institution. By this, we mean actively speaking out and addressing acts of racism, racist comments, racist practices, policies, and procedures."]]], [52, [["Extracurricular Short Response", "Please briefly elaborate on one of your extracurricular activities or work experiences."], ["Why This College Essay", "Please describe why you are interested in attending Tulane University"], ["Diversity Essay", "Tulane values the lessons gained from pursuing an education alongside a student body that represents a wide range of experiences and perspectives and is reflective of our multicultural world. If you would like to share a perspective related to your family, cultural group, sexual or gender identity, religious group, or some other aspect that has shaped your identity, please do so here."]]], [55, [["Why This College Short Response", "Why do you wish to attend Colorado College and how would the Block Plan serve your educational goals?"], ["Extracurricular Short Response", "Please briefly elaborate on one of your extracurricular activities or work experiences."]]], [56, [["Select-A-Prompt", "Tell us about the most unusual talent you have, and how you have made it useful."], ["Select-A-Prompt", "Spiders are essential to the ecosystem. How are you essential to your community or will you be essential in your university community?"], ["Select-A-Prompt", "Please share one idea for actions or policies that you think would begin to address an issue of racial or social injustice."]]], [57, [["Favorite Song Short Response", "Music means so many things to so many people. It can bring us joy, inspire us, validate us or heal us. Please tell us about a song or piece of music that is particularly meaningful to you and why. Please include the name of the song/piece and the artist."]]], [59, [["Students Interested in Research Short Response", "What field/area of study are you interested in researching?"], ["Combined Degree Program Essay", "What relevant experiences or insight have led to your interest in this particular program? Describe how Rochester’s resources: facilities, faculty, peers and research will meet your academic and personal ambitions. Describe how you see yourself contributing to the challenging field you want to enter as a Rochester graduate."], ["Select-A-Prompt", "American social reformer, abolitionist, writer and statesman Frederick Douglass said, \"Some know the value of education by having it. I knew its value by not having it.\" Explain ways in which education has directly influenced you and your ability to do good in the world. How will you use the curricular flexibility and co-curricular opportunities of the University of Rochester experience to grow and to promote positive change for yourself, your community and the world?"], ["Select-A-Prompt", "Dr. Donna Strickland, University of Rochester alum and 2018 Nobel Prize winner in Physics said, \"There‘s no point in me being anything other than me.\" The University of Rochester encourages each student to embrace who they are and create their own individual curricular path and experience. How will you use the opportunities here to fully be who you are? What unique perspectives will you bring to our community?"], ["Select-A-Prompt", "The University of Rochester benefactor, entrepreneur, photography pioneer, and philanthropist George Eastman said, \"What we do during our working hours determines what we have; what we do in our leisure hours determines what we are.\" Looking forward towards your college experience, what do you hope to do outside of the classroom at the University of Rochester that will enhance who you are as a person? How will specific academic and social opportunities here help you grow?"], ["Select-A-Prompt", "Essay Response: Write an analytical or creative response of 200 words or less."], ["Select-A-Prompt", "Creative Response: Upload up to three works of your own art (e.g. pictures, video, performances, literary) and use the space below to provide a brief explanation as to how the art is tied to making the world, your community, and those around you “ever better.”"], ["Select-A-Prompt", "Research Response: Upload an abstract describing your own related research and use the space below to provide a brief explanation as to how the research is tied to making the world, your community and those around you “ever better.”"]]], [60, [["Select-A-Prompt", " Students at Boston College are encouraged to consider critical questions as they pursue lives of meaning and purpose. What is a question that matters to you and how do you hope Boston College will help you answer it?"], ["Select-A-Prompt", "In 2020, we faced a national reckoning on racial injustice in America - a reckoning that continues today. Discuss how this has affected you, what you have learned, or how you have been inspired to be a change agent around this important issue."], ["Select-A-Prompt", "At Boston College, we hope to draw on the Jesuit tradition of finding conversation partners to discuss issues and problems facing society. Who is your favorite conversation partner? What do you discuss with that person?"], ["Select-A-Prompt", "Socrates stated that “the unexamined life is not worth living.” Discuss a time when reflection, prayer, or introspection led to clarity or understanding of an issue that is important to you."], ["Select-A-Prompt", "Each year at University Convocation, the incoming class engages in reflective dialogue around a common text. What book would you recommend for your class to read and explore together – and why?"], ["Select-A-Prompt", "Human-Centered Engineering (HCE) Applicants: One goal of a Jesuit education is to prepare students to serve the Common Good. Human-Centered Engineering at Boston College integrates technical knowledge, creativity, and a humanistic perspective to address societal challenges and opportunities. What societal problems are important to you and how will you use your HCE education to solve them?"]]], [62, [["Why This College Short Response", "Why Lafayette?"], ["Why This College Short Response", "Why Lafayette?"]]], [63, [["Joint Degree Programme Essay", "As an applicant to the Joint Degree Programme you are required to submit an additional 1500 – 2000 word essay outlining your interest in the particular academic area to which you are applying – Classical Studies, Economics, English, Film Studies, History, or International Relations; and what particularly interests you about the JDP in your chosen major. Be as specific as you can. Demonstrating that you are familiar with the JDP website—its policies and curriculum—will be helpful to your application, as will examples of your ability to take on a particularly challenging, as well as rewarding, educational experience that demands adaptability, flexibility, and an appreciation for other cultures and institutional practices."], ["Identity Essay", "Beyond your impressive academic credentials and extracurricular accomplishments, what else makes you unique and colorful? We know nobody fits neatly into 500 words or less, but you can provide us with some suggestion of the type of person you are. Anything goes! Inspire us, impress us, or just make us laugh. Think of this optional opportunity as show and tell by proxy and with an attitude."]]], [65, [["Why This College Short Response", "Why have you chosen to apply to Scripps College?"], ["Select-A-Prompt", "If you could trade lives with someone (fictional or real) for a day, who would it be and why?"], ["Select-A-Prompt", "You’ve invented a time machine! When and where is your first destination and why?"], ["Select-A-Prompt", "You have just been invited to give a TED talk. What will you talk about and why did you select that topic?"]]], [66, [["Extracurricular Essay", "Do you have any employment or family obligations that limit your participation in extracurricular activities? If so, please describe."], ["Help on Application Short Response", "Have you participated in or been assisted in your college preparation and search by programs outside of classroom, such as Educational Talent Search, Take Stock in Children, Upward Bound, Boys and Girls Club, etc.? Please provide the name of the program, details/benefits of your involvement, and how long your experiences continued."], ["Extracurricular Essay", "Please provide more details on your most meaningful commitment outside of the classroom while in high school and explain why it was meaningful. This could be related to an extracurricular activity, work, volunteering, an academic activity, family responsibility, or any other non-classroom activity. "], ["Additional Info Essay", " Is there any additional information or extenuating circumstances the Admissions Committee should know when reviewing your application? "], ["Why This Program Short Response", "Why is applying for the UF Honors Program important to you? Which aspects of the program‘s three pillars of opportunity, community, and challenge pique your interests? How would you engage with the program to exemplify these pillars yourself? How does the program factor into your long-term goals? Please be specific. "], ["Interdisciplinary Solution Short Response", "Identify two topics you have previously studied that do not traditionally overlap. How do you envision you might bring these topics together during your time in Honors to engage a pressing societal, medical or technological concern? The concern you wish to engage could be of local, national or global scope, but you should be clear about the issue you want to address. For the purposes of this essay, the topics you identify need not have been formally studied in high school, but you should have studied them since beginning in high school. "]]], [67, [["Why This Major Short Response", "Why do you want to study your chosen major specifically at Georgia Tech?"]]], [68, [["Extracurricular Short Response", "Please briefly elaborate on one of your extracurricular activities or work experiences in the space below. "], ["Why This College Short Response", "Why are you interested in Bryn Mawr?"], ["Community Service Essay", "As you prepare to join a new college community, reflect on your role as a community member throughout the past four years. What legacy do you hope to leave behind?"]]], [69, [["Why This College Short Response", "What about being a student at Boston University most excites you?"], ["Additional Info Essay", "Please use this space if you have additional information, materials, or writing samples you would like us to consider."], ["Accelerated Program in Liberal Arts and Medicine Essay", "The Accelerated Programs Admission Committee is interested in learning more about you. Please write an essay of no more than 750 words on why you wish to enter the health professions, including what experiences have led you to this decision and what you hope to gain from your chosen profession. Please make sure this essay is completely distinct from your Common Application Personal Essay."], ["Select-A-Prompt", "What about the Kilachand Honors College resonates with you, and how would Kilachand‘s curriculum fulfill your academic, creative, intellectual, and/or professional goals?"], ["Select-A-Prompt", "If you could create a new Kilachand course, what would it be? How would your imagined course align with the core values of Kilachand?"], ["Select-A-Prompt", "What about the Kilachand Honors College resonates with you, and how would Kilachand‘s curriculum fulfill your academic, creative, intellectual, and/or professional goals?"], ["Select-A-Prompt", " If you could create a new Kilachand course, what would it be? How would your imagined course align with the core values of Kilachand?"]]], [70, [["TX Honors Comp Sci &amp; Business Program Essay", "Texas CSB is an innovative dual degree program looking for students who are dedicated to both computer science and business. Why do you see this as a powerful combination of skills for your career goals? What have you done in high school to prepare you for computer science and business course work? "], ["ECB Dual Degree Program Essay", "Honors Electrical and Computer Engineering and Business (ECB) is a powerful dual degree program looking for students who are dedicated to both an electrical and computer engineering and business honors education. Why do you see this as a combination of skills for your career goals? What have you done in high school, in the classroom and outside, to prepare you for honors engineering and business course work? \n"], ["Nursing Majors Essay", "Select Nursing as your first choice major and submit responses to the following short answer prompts:"], ["Architecture Majors Short Response", "Respond to the following short answer prompt — What does creativity mean to you? How might your view of creativity shape your approach to your college education in a creative field? \n"], ["Architecture Majors Short Response", "Respond to the following prompt — Take and upload three photographs from a camera, smart phone or mobile device that capture how you see the world. Describe what is interesting to you or what you are trying to evoke with these images. "], ["Art and Art History Majors Essay", "In 500 words or less, please tell us about a meaningful way in which an artwork, or artist, has changed your life. How has this prompted your ambitions for a life in the arts?"], ["Social Work Majors Essay", "Discuss the reasons you chose Social Work as your first-choice major and how a Social Work degree from UT will prepare you for the future."], ["Department of Radio, Television, and Film Essay", "If you wish, you may submit either a video/short film or a written review/critique to support your application. This may be something you did for school or on your own. This is an opportunity to show us your potential as an RTF student. The duration of the video should be no more than 5 minutes OR the review/critique should be no more than 500 words. Either item will be submitted within MyStatus after you have submitted your application."], ["Overcoming Challenges Essay", "Tell us your story. What unique opportunities or challenges have you experienced throughout your high school career that have shaped who you are today?"], ["Why This Major Short Response", "Why are you interested in the major you indicated as your first-choice major? "], ["Leadership Short Response", "Describe how your experiences, perspectives, talents, and/or your involvement in leadership activities (at your school, job, community, or within your family) will help you to make an impact both in and out of the classroom while enrolled at UT. "], ["Community Service Short Response", "The core purpose of The University of Texas at Austin is, \"To Transform Lives for the Benefit of Society.\" Please share how you believe your experience at UT-Austin will prepare you to \"Change the World\" after you graduate. "], ["Additional Info Short Response", "Please share background on events or special circumstances that you feel may have impacted your high school academic performance, including the possible effects of COVID-19. "], ["Business Honors Program Short Response", "Discuss a single piece of business news in the last year that has affected your view on the need for a high-quality business education, and tell us why this has affected or reinforced your desire for a business education. You do not need to go into detail about this piece of business news--a quick reference to the event will suffice. It can be something that occurred in your community, in the U.S., or internationally. Spend the majority of your response on how this event affected your views. \n"], ["Design BA/BFA Applicants Essay", "Design is a broad field that can be practiced in many ways for many purposes. As designers, we might create projects that:"]]], [73, [["Diversity Essay", "The Trinity College community is characterized by engagement, inclusion, and collaborative partnerships. Based on the different communities that you are a member of, how will you engage with and leave an impact on the Trinity College community?"]]], [74, [["Why This College Essay", "Your moment has arrived. Share with us the moments or experiences that have led you to apply to Babson College"], ["Extracurricular Short Response", "Please briefly elaborate on one of your extracurricular activities or work experiences."], ["Experience with Discrimination Short Response", "If you have ever experienced discrimination, in any form, due to your racial, religious, gender, or sexual identity, please select yes. If comfortable, you may also opt to share that experience. Additionally, please know we are here to support you. In whatever way feels meaningful to you, please let us know what support looks like for you."], ["Additional Info Short Response", "If you answer “yes” to this question on the application, please provide a written explanation about what happened, including details regarding the behaviors you were found responsible for and the outcome you received, including suspension, expulsion, etc. The college is particularly interested in learning more about the process of change you have undergone after these events. Answering “yes” to this question is not an automatic bar to admission. The Admissions Committee will review all candidates holistically and will seek to understand the context of any “yes” answers.\n<br />Please explain"]]], [75, [["Diversity Essay", "We fully acknowledge application forms like this often require people to categorize their race, ethnicity, gender, and/or other identities by checking boxes. Two of Macalester‘s four values are Multiculturalism and Internationalism and one way we try to live these values is providing students space to express their identities \"beyond a check box.\" You may use this space to help us better understand the importance of one or more identities in your life and how they might shape your worldview. "], ["Additional Info Essay", "Has there been a significant fluctuation in your grades at any point during grades 9-12 (up or down)? If so, please tell us the reason(s) for the changes."], ["Criminal Activity Essay", "Have you ever been found responsible for a disciplinary violation at any educational institution you have attended from the 9th grade (or the international equivalent) forward, whether related to academic misconduct or behavioral misconduct, that resulted in an out of school suspension or more significant sanction? "], ["Community Service Essay", "Macalester is one of few highly selective liberal arts colleges located in the middle of a metropolitan area. Students benefit from the strong sense of community on campus and opportunities to engage in academic, social, and civic engagement options in the Twin Cities of Minneapolis and St. Paul. Have you thought about how Macalester‘s location might impact your experience? If so, in what ways?"]]], [76, [["Pre-Professional Scholars Program Essay", "By applying to the Pre-Professional Scholars Program, you are applying to gain admission to professional school earlier than students who apply in the traditional way. Please indicate why you’re interested in your chosen profession. How do you see yourself being particularly suited to this field? What events and/or experiences have led you to your choice?"], ["Pre-Professional Scholars Program Essay", "Pre-Professional Scholars Program Applicants: In the college application process, you are constantly prompted for a list of your achievements, awards, and accomplishments. While this information is useful to us, we are interested in hearing more about you. Describe an event, achievement, or experience of which you are particularly proud but that will not show up on a resume, may not garner any recognition, and does not appear anywhere else on your admission application."]]], [79, [["Why This Major Short Response", "Please explain your interest in your first-choice major/undecided status and your second-choice major, should you opt to list one."]]], [80, [["Overcoming Challenges Short Response", "The University of Miami‘s official mascot is the ibis. Folklore maintains that the native marsh bird is the last to take shelter before a hurricane hits and the first to emerge once the storm passes, making it an apt symbol of courage and resilience."]]], [81, [["Why This College Essay", "The Admission Committee would like to know why you want to call Villanova your new home and become part of our community?"], ["Select-A-Prompt", "St. Augustine states that well-being is “not concerned with myself alone, but with my neighbor’s good as well.”  How have you advocated for equity and justice in your communities?"], ["Select-A-Prompt", "What is the truest thing that you know?"], ["Select-A-Prompt", "One of the themes in St. Augustine‘s book, Confessions, is the idea of redemption. Tell us your story of being given a second chance."], ["Select-A-Prompt", "In the Villanova community, we believe that we all learn from one another. What is a lesson in life that you have learned that you would want to share with others?"], ["Select-A-Prompt", "Augustine’s “Miracles are not contrary to nature but only contrary to what we know about nature.” Tell us about a societal issue that you believe the wonder of technology is well-poised to help solve."]]], [83, [["Why This College Short Response", "Briefly describe what prompted you to apply to Santa Clara University. Based on what you know about SCU and our Jesuit mission to educate citizens and leaders of competence, conscience, and compassion, how do you envision your life at SCU and beyond?"], ["Ethical Dilemma Short Response", "At SCU, we push our students to be creative, be challenged, and be the solution. Think about an ethical dilemma that you care about that our society is currently facing. This can be something happening in your local community or more globally. How can an SCU education help you prepare for and address this challenge?"]]], [85, [["Select-A-Prompt", "Tell us why you are interested in attending Mount Holyoke College."], ["Select-A-Prompt", "If you had a superpower, what would it be and how would you use it?"], ["Select-A-Prompt", "What role has social media played in your engagement with a particular issue, whether local or global?"]]], [86, [["Joint Medical Program Essay", "Please discuss your interest in osteopathic medicine and what personal characteristics and experiences make you a good match for the program. "], ["Select-A-Prompt", "Describe what you are looking for from your college experience and why Pitzer would be a good fit for you."], ["Select-A-Prompt", "Reflecting on your involvement throughout high school or within the community, how have you engaged with one of Pitzer’s core values?"], ["Select-A-Prompt", "Pitzer is known for our students’ intellectual and creative activism. If you could work on a cause that is meaningful to you through a project, artistic, academic, or otherwise, what would you do?"]]], [87, [["Amusing Anecdote Short Response", "The college admissions process can create anxiety. In an attempt to make it less stressful, please tell us an interesting or amusing story about yourself from your high school years that you have not already shared in your application."]]], [88, [["Overcoming Challenges Essay", "Tell a story from your life, describing an experience that either demonstrates your character or helped to shape it."], ["Diversity Essay", "Our families and communities often define us and our individual worlds. Community might refer to your cultural group, extended family, religious group, neighborhood or school, sports team or club, co-workers, etc. Describe the world you come from and how you, as a product of it, might add to the diversity of the UW."], ["Additional Info Essay", "You are not required to write anything in this section, but you may include additional information if something has particular significance to you. For example, you may use this space if:"], ["Why This College Essay", "Please reflect and respond to the following question, and in doing so explain your interest in the UW Interdisciplinary Honors Program. What is interdisciplinary learning and why is it important to you?"], ["Community Service Essay", "The Interdisciplinary Honors program pushes students to engage with their local, national, and global communities through a multidisciplinary lens. Consider a pressing societal concern that impacts and/or interests you. Please explain the issue, your relationship to it, and how you imagine engaging with or addressing this concern at UW?"]]], [89, [["Journalism and Mass Communication Major Essay", "Write a profile of yourself in news or news feature style, as if you had interviewed yourself."], ["Political Communication Essay", "If you could be any one person who has been active in politics, who would you choose to be and why?\n"], ["Cisneros Hispanic Leadership Institute Essay", "At the Cisneros Hispanic Leadership Institute, we believe that leadership takes many forms – service, advocacy, involvement in student organizations, even supporting your family. "], ["Select-A-Prompt", "At the George Washington University, our students frequently interact with policymakers and world leaders. These experiences and those of our alumni can shape the future of global affairs. If you had the power to change the course of history in your community or the world, what would you do and why? "], ["Select-A-Prompt", "The George Washington University encourages students to think critically and to challenge the status quo. Thus, civil discourse is a key characteristic of our community. Describe a time when you engaged others in meaningful dialogue around an issue that was important to you. Did this exchange create change, new perspectives, or deeper relationships?"]]], [93, [["Myra Kraft Program Short Response", "What makes you a good candidate for the Myra Kraft Transitional Year Program?"], ["International Business Scholars Short Response", "Brandeis International Business School offers a unique Scholars program for Brandeis undergraduates. Upon admission to Brandeis University, Scholars are provisionally admitted to select specialized master’s degrees or considered for fast-track admissions to the MBA degree. During their junior year, the student then selects their graduate program of interest and receives a guaranteed scholarship for this graduate program."], ["Additional Info Short Response", "The Brandeis community is a diverse group of critical thinkers defined by their ability to dive deeper into their learning by questioning, analyzing, evaluating, creating, critiquing and seeking other perspectives. Share an example of how you have used your own critical thinking skills on a specific subject, project, idea or interest."], ["Why This College Short Response", "Brandeis attracts students from many parts of the world. As an international student at Brandeis, how would you enrich the campus community?"]]], [95, [["Why This Major Short Response", "Explain why you selected the academic program(s) above and why you are interested in studying these at NC State."], ["Overcoming Challenges Short Response", "Discuss any other obstacles and/or hardships that you have encountered that have affected you personally or academically and how you dealt with them."], ["Diversity Short Response", "NC State University is committed to building a just and inclusive community, one that does not tolerate unjust or inhumane treatment, and that denounces it, clearly and loudly. Please describe what those words mean to you and how you will contribute to a more diverse and inclusive NC State environment."]]], [96, [["Why This College Essay", "Tell us why you decided to apply to the University of Wisconsin-Madison. In addition, please include why you are interested in studying the major(s) you have selected. If you selected undecided please describe your areas of possible academic interest."], ["Influential Moment Essay", "UW Application Only (not for Common App users) This part is all about you. Tell us about something you’ve done—academically or personally—and what you’ve learned from it. Was it a success or a challenge? Did it represent a turning point in your life? How did this particular moment in your life influence you, and how will it continue to influence you as you pursue your college education?"]]], [97, [["Why This College Short Response", "What makes TCU a great fit for you? (Recommended Length: 100 words)"], ["Diversity Short Response", "Describe how you have or plan to contribute to an inclusive college environment. (Recommended Length: 100 words)"], ["Additional Info Essay", "Completion of the questions below is optional. TCU values individuality and believes that students are more than just a GPA and test score. To help us get to know you even better, consider this opportunity to further express yourself. The only limitations are the boundaries of your imagination. Please upload an essay, poem, work of art or a URL that showcases another side of you."]]], [101, [["Learning Cluster Essay", "During January block, Soka students participate in a Learning Cluster or research seminar where students work in teams with faculty to propose, research, and model constructive approaches to local, regional and/or global issues. What question would you investigate during a Learning Cluster? Describe why this topic is one you are passionate about and how you envision solving or supporting this particular issue. "], ["Why This College Essay", "In today‘s world, what is your purpose in seeking a liberal arts education? Among the many fine colleges and universities you might attend, how do you think SUA could help you fulfill that purpose?"]]], [102, [["Why This College Essay", "Why are you applying to Occidental? What are your intellectual curiosities and why do you think Occidental is the right place for you to pursue them?"], ["Quirks Short Response", "Quirks, idiosyncrasies, peculiarities. They help differentiate us. What is one of yours?"], ["Song Short Response", "What is the first song you would play for your roommates on move-in day?"], ["Food Truck Short Response", "If you had your own food truck or restaurant, what would it be called?"], ["Select-A-Prompt", "Research is an integral part of an Oxy education. Completing a senior comprehensive is a requirement of every Oxy student. Additionally, there are opportunities with the Institute for the Study of Los Angeles, the Urban and Environmental Policy Institute, the International Richter Grant, the Summer Undergraduate Research Center, and other departments to conduct research. What is something you would like to research and why? "], ["Select-A-Prompt", "Briefly describe a current event or social movement that is affecting a city, town, or place that is important to you. Describe its significance to the community, its significance to you, and future implications for that community."], ["Select-A-Prompt", "Oxy’s central mission emphasizes the value of community amidst diversity. What do you value in a community and how do you see your perspectives and life experiences enhancing it?"]]], [103, [["Why This College Short Response", "SMU appeals to students for a variety of reasons. Briefly describe why you are interested in attending SMU and what specific factors have led you to apply."], ["Diversity Short Response", "SMU is a diverse learning environment shaped by the convergence of ideas and cultures. How will your unique experiences or background enhance the University, and how will you benefit from this community? "]]], [107, [["Travel Short Answer", "If I could travel anywhere, I would go to..."], ["Fact Short Answer", "The most interesting fact I ever learned from research was..."], ["Academic Interest Short Answer", "In addition to my major, my academic interests include..."], ["Last Tuesday Short Answer", "My favorite thing about last Tuesday was..."], ["Interesting Fact Short Answer", "Something you might not know about me is..."]]], [108, [["Human Achievement Short Response", "What is one human achievement or innovation you would like to see in your lifetime?"], ["Fun Fact Short Response", "When meeting someone for the first time, what do you want them to know about you but generally do not tell them?"], ["Passion Short Response", "Please describe something about which you are passionate. If you would like, please free to share a link to a video which best illustrates this passion.  The link can be a found video, such as from YouTube, or can be an original video filmed on your own."], ["Taking Risks Essay", "Describe a time in your life when you had to decide between taking a risk and playing it safe. What choice did you make? What was the outcome of your choice? Would you have made the same decision looking back on the experience, or would you make a different decision?"], ["Select-A-Prompt", "What lessons have you learned from high school that you have applied in your life? How have these lessons further defined your values and character?"], ["Select-A-Prompt", "Character, values, leadership, and potential: these are characteristics that we are looking for at YU.  Please provide examples from your life, your experiences, or your aspirations and how they will be further defined, enhanced, or developed at YU."], ["Select-A-Prompt", "As we emerge from the COVID-19 pandemic, it is important to reflect on the past while focusing on hope, happiness and ways to express Hakarat Hatov (gratitude). Please highlight an example where you, your family members or friends have exemplified Hakarat Hatov and the impact it has had on you on a personal level and/or within your community, whether COVID related or not."]]], [109, [["Why This College Short Response", "Why are you interested in American University?"]]], [115, [["Overcoming Challenges Essay", "How have your life experiences and/or endeavors prepared you to be a Morrill Scholar? Please answer fully, and when possible, provide specific examples."], ["Morrill Scholarship Program Short Response", "The Morrill Scholarship Program (MSP) is one of Ohio State’s premier scholarship opportunities offered through the Office of Diversity and Inclusion (ODI). MSP seeks academically talented student leaders who have demonstrated a commitment to advancing diversity, inclusion, service and social justice."]]], [116, [["Diversity Short Response", "The University values diversity, broadly defined to include diversity of experiences, perspectives, backgrounds, and talents. Enrolling a diverse community of scholars interested in learning with and from each other fosters discussion and discovery inside and outside of the classroom. Please share briefly how you might contribute to, or benefit from, our community of scholars."], ["Why This Major Short Response", "Please include an explanation of why you would like to study the major(s) you have selected. You may also use this space to indicate your interest in other major(s) in the colleges listed above."], ["Nursing Majors Short Response", "Why have you chosen to pursue a nursing career? Explain how your experiences shaped your decision."], ["Nursing Major Short Response", "How have your studies prepared you for a career in nursing?"], ["Nursing Major Short Response", "Provide a brief reflection about why you feel the University of Minnesota School of Nursing will be the best fit with your degree and career plans."], ["Why This Major Short Response", "Why have you chosen to pursue a nursing career? Explain how your experiences shaped your decision. (Required. Please limit your response to 250 words)."], ["Nursing Short Response", "How have your studies and activities prepared you for a career in nursing? (Required. Please limit your response 250 words).*"], ["Why This College Short Response", "Please provide a brief reflection about why you feel the University of Minnesota School of Nursing will be the best fit with your degree and career plans. (Required. Please limit your response 250 words)."]]], [117, [["Why This College Essay", "Worcester Polytechnic Institute seeks students who are the right fit for its academic and campus community. In what ways are you the right fit for the distinctive educational and campus experience that Worcester Polytechnic Institute offers?"]]], [118, [["Extracurricular Short Response", "Please briefly elaborate on one of your extracurricular activities or work experiences."], ["Why This College Short Response", "How will opportunities at Purdue support your interests, both in and out of the classroom?"], ["Why This Major Short Response", "Briefly discuss your reasons for pursuing the major you have selected."], ["Why This College Essay", "Explain your vision, ideas, or goals for how you hope to shape your honors experience while at Purdue. Please put this in the context of the four pillars which are the foundation of the Honors College."], ["Why This Major Essay", "Please describe the interdisciplinary nature of your chosen field of study and how it complements or supports other fields. (Examples: You might describe how your work in a liberal arts career may impact or inform the work of an engineer.)"]]], [119, [["Why This College Essay", "We invite you to share any additional information about why you would like to attend Bentley. (250 words or fewer)"]]], [120, [["Why This College Essay", "Please briefly state your reason for wishing to attend LMU and/or how you came to select your major."], ["Additional Info Essay", "As part of our holistic review process, it is critical that we understand the comprehensive experience of all applicants. Please provide a detailed explanation, in 250 words or less, regarding any break or interruption in your academic history throughout high school (secondary school) and beyond."]]], [121, [["New Course Short Response", "For one week at the end of January, Reed students upend the traditional classroom hierarchy and teach classes about any topic they love, academic or otherwise. This week is known as Paideia after the Greek term signifying “education” – the complete education of mind, body and spirit. What would you teach that would contribute to the Reed community?"], ["Additional Info Short Response", "Tell us what you‘ve been doing since you last applied to Reed."]]], [122, [["Why This College Short Response", "What excites you about St. Olaf?"], ["Everyone Knows Short Response", "Everyone knows... we‘ve read about your accomplishments in your application.\n<br />Everyone knows that I..."], ["No One Knows Short Response", "No one knows... there are no wrong answers here - just be your authentic self.\n<br />No one knows that I... "], ["Background Short Response", "You should know... we are eager to learn more about you.\n<br />St. Olaf should know that I..."], ["Select-A-Prompt", "We have a goal to create a community of students from diverse backgrounds with unique ideas, identities, and perspectives. Reflect on an experience that made you reconsider the way you see the world. How did you engage with new and challenging ideas?"], ["Select-A-Prompt", "During the four-week Interim, St. Olaf students take one course that is often interdisciplinary, experiential, and could even be off-campus. Design your dream Interim course and write a short description of what it would look like and involve.\n"]]], [123, [["Additional Info Essay", "If you wish to submit your optional personal statement, you may upload it here."]]], [124, [["Extracurricular Short Response", "Please briefly elaborate on one of your extracurricular activities or work experiences."], ["Why This College Short Response", "Why are you interested in Rensselaer Polytechnic Institute?"], ["BS/MD Program Essay", "State your reasons for aspiring to a career in medicine."], ["Music Majors Essay", "Describe your interest in music and state your goals. Please include completed coursework in music, private music instruction, musical performance and production experience, or independent projects completed."], ["Game and Simulation Arts Major Essay", "State your reasons for choosing the field of Games and Simulation Arts and Sciences and make reference to your portfolio, if one has been submitted."], ["Electronic Arts Major Essay", "Discuss your interests in the field of electronic arts, and state how this is reflected in your portfolio, if one has been submitted."], ["Architecture Major Essay", "State your reasons for choosing architecture as your profession."]]], [125, [["Why This College Essay", "Pepperdine is a Christian university where all are welcomed and encouraged to challenge each other in the pursuit of truth. Students, faculty, and staff members from all backgrounds participate in conversations of faith inside and outside of the classroom. Considering that Pepperdine is a Christian university, why are you interested in attending and how would you contribute to conversations of faith on campus?"]]], [129, [["Why This College Short Response", "What are you looking for in a university, why do you want to attend Baylor, and how do you see yourself contributing to the Baylor community?"]]], [130, [["Passion Short Response", "Describe a topic, idea, or experience that you find so engaging that it makes you lose all track of time. What have you done to learn more or engage further in the topic, idea or experience? What resources do you use to learn more?"], ["Community Service Essay", "Have you become aware of significant needs in your family, school, and/or community? Please explain how you have worked toward meeting those needs."], ["Overcoming Challenges Essay", "Briefly describe a time that your efforts have fallen short, a goal was not accomplished, or an aspiration was not achieved."], ["Overcoming Challenges Essay", "What steps did you take to recover from this defeat? What resources did you use? How and why are you different today?"], ["Community Service Essay", "We strive to create a rich and varied educational environment through admitting students with a wide range of:"], ["Extracurricular Essay", "Thoughtfully consider the extracurricular activities you have been involved in and select two to write about. Enter your first activity below and the second activity on the following page."]]], [132, [["Why This Major Essay", "If you‘re applying to a major: In the past 3 to 4 years, what experience(s) have you had (inside or outside of the classroom) related to your selected first-choice major or academic interest?"], ["Why This Major Essay", "If you‘re applying to a major: How does your selected first-choice major relate to your future career goals?"], ["Undeclared Majors Short Response", "If you‘re applying to Our Undeclared Program: What are your academic interests and strengths? You may also include any majors you are considering."], ["Undeclared Major Short Response", "If you‘re applying to Our Undeclared Program: What are your future academic or career goals?"], ["Second-Choice Major Short Response", "If you‘ve selected a Second-Choice Major (Including Undeclared): Please explain your interest in your second-choice major or your overall academic or career goals."]]], [133, [["Additional Info Essay", "Please tell us something about yourself, your experiences, or activities that you believe would reflect positively on your ability to succeed at Penn State. This is your opportunity to tell us something about yourself that is not already reflected in your application or academic records."], ["Other Plans Essay", "What would you like to do for the next few years if you didn’t go to college?"], ["Society Essay", "How will our society be remembered in 100 years? (800 words)"], ["Science BS/MBA Short Response", "Why do you want to attend Penn State?"], ["Science BS/MBA Short Response", "Select the scientific discipline above that is MOST interesting to you. Why do you want to devote 3 or 4 years of college studying it?"], ["Science BS/MBA Short Response", "Inclusiveness and Diversity: In an increasingly global community, it is essential that students gain cultural competency. In what way have you demonstrated a commitment to this mission?"], ["Science BS/MBA Short Response", "Goals: Discuss your career aspirations. How would the Science BS/MBA program help you reach those goals?"], ["Science BS/MBA Short Response", "Leadership: Please discuss your leadership and collaboration skills. Give recent examples of how they have been demonstrated."], ["Science BS/MBA Short Response", "Resiliency: Transitioning to college can be a challenge. Discuss the adjustments you believe you will need to make in order to be successful as you transition from high school to a college environment."], ["Science BS/MBA Short Response", "Describe your biggest commitment. "], ["Science BS/MBA Short Response", "Describe a time when you helped someone else succeed."]]], [134, [["Why This College Short Response", "Why are you interested in The University of Tulsa?"], ["Community Service Short Response", "Who in your life is depending on you? What are they depending on you for?"], ["College Experience Short Response", "What are you most looking forward to in your college experience?"], ["Additional Info Short Response", "Is there anything else you’d like to share?"], ["Extracurricular Short Response", "Please briefly elaborate on one of your extracurricular activities or work experiences."]]], [136, [["Overcoming Challenges Essay", "Tell us your story. What unique opportunities or challenges have you experienced throughout your high school career that have shaped who you are today?"], ["Additional Info Essay", "Please explain any special circumstances that could affect your family‘s ability to pay for your college expenses."], ["Why This College Essay", "Why have you chosen to apply to this university?"], ["Why This Major Essay", "Why have you chosen this major?"], ["Future Goals Short Response", "Describe any educational plans you have beyond earning your bachelor‘s degree"], ["Personal Goals Short Response", "What are some of your life goals? Your answer may include educational, professional or personal goals"], ["Supplemental Leadership Essay", "How do you show leadership in your life? How do you see yourself being a leader at Texas A&amp;M University? Tips to consider: Leadership can be demonstrated by positions you hold as an officer in a club/organization, but other types of leadership are important too. Leaders can emerge in various situations at any given time, including outside of school. Share a brief description of the type of leadership qualities you possess, from school and non-school related experiences including leadership in your job, your community, or within your family responsibilities. Then, share how you hope to demonstrate leadership as a member of our campus community."], ["Why This Major Essay", "Please explain why you are interested in Chemical Engineering at Texas A&amp;M, and where you see yourself five years after graduation."], ["Influential Person", "Tell us about the person who has most impacted your life and why."], ["Overcoming Challenges Essay", "Describe a life event which you feel has prepared you to be successful in college."], ["Engineering Essay", "Describe your academic and career goals in the broad field of engineering (including computer science, industrial distribution, and engineering technology). What and/or who has influenced you either inside or outside the classroom that contributed to these goals?"]]], [137, [["Why This College Essay", "What makes you unique? Why is Berea perfect for you? Share a personal statement of 500(ish) words with your Admissions Counselor so we can get to know you better."]]], [138, [["Global Change Essay", "If you could change anything in the world, what would it be?  Explain why and how you would change it."], ["International Applicants Short Response", "Describe an experience where you had to adapt to a new environment (i.e. a different culture, situation, or way of thinking)"]]], [140, [["Community Service Essay", "Virginia Tech’s motto is \"Ut Prosim\" which means ‘That I May Serve‘. Share how you contribute to a community that is important to you. How long have you been involved? What have you learned and how would you like to share that with others at Virginia Tech?"], ["Overcoming Challenges Essay", "Resilience is defined as the ability to adapt and learn from a difficulty. Reflect on a time that you have exhibited resilience. What growth did you see in yourself after this experience?"], ["Leadership Short Response", "Share a time when you were most proud of yourself either as a role model or when you displayed your leadership. What specific skills did you contribute to the experience? How did others rely on you for guidance? What did you learn about yourself during this time?"], ["Achieving Goals Short Response", "Describe a goal that you have set and the steps you will take to achieve it. What made you set this goal for yourself? What is your timeline to achieve this goal? Who do you seek encouragement or guidance from as you work on this goal?"]]], [142, [["Why This College Short Response", "Out of the thousands of universities and colleges, what excites you about attending Chapman University specifically?"], ["Dream Job Short Answer", "What is your dream job?"], ["Describe Yourself Short Answer", "Please list three words to describe yourself. "], ["Song Short Answer", "What song should we be listening to while reading your application?"], ["Favorite Dish Short Answer", "Name one dish you would cook for our admission team."], ["Favorite Subject Short Answer", "What is your favorite subject?"], ["Bucket List Short Answer", "What is the top thing on your bucket list?"], ["Happiness Short Answer", "What makes you happy?"], ["Hometown Short Answer", "Created by a prospective student of the Fall 2019 class: If Chapman’s admission team came to visit your hometown, what site would you take them to?"], ["Presentation Short Answer", "Created by a prospective student of the Fall 2020 class: What can you give a 30-minute presentation on without any preparation?"], ["College Course Short Answer", "Created by a prospective student of the Fall 2021 class: If you could teach a college course that best describes you, what would it be called?"], ["Learning Short Answer", "Created by a prospective student of the Fall 2022 class: What is something you have always wanted to learn but never had the chance to?"], ["Select-A-Prompt", "Every Chapman student holds multiple identities that create the diverse fabric of our community. Our committee would like to hear about the intersectionality of your identities and how those have played a crucial role in your life."], ["Select-A-Prompt", "Part of the Chapman student experience is to grow or transform your own perspectives. What impact would you like to have at Chapman and what legacy would you like to leave on our community?"]]], [144, [["Why This College Short Response", "Why are you interested in Syracuse University and how do you see yourself contributing to a diverse, inclusive, accessible and respectful campus?"], ["Citizenship and Civic Engagement Program Essay", "Submit a personal statement that addresses the questions below. Please do not exceed two single-spaced pages.\n<br />1. Discuss a recent event or news story that inspired you to take action. What did you attempt to change or achieve? Were you successful or not? What did you learn from the experience?\n<br />2. How do you anticipate the CCE major will enhance your intended major(s)? What are your future career goals? What else would you like the committee know as it considers your application?"]]], [146, [["Select-A-Prompt", "As a liberal arts school, Providence College provides students with the opportunity to explore several different academic areas. While you may not be ready to declare a major, what have you experienced, inside or outside of the classroom, that has led you to an interest in a particular field of study?"], ["Select-A-Prompt", "Dialogue, Inclusion, and Democracy is a program on campus whose mission is to create a safe space that supports the development of well-informed and engaged students through civil discourse. There are several spaces on campus where students, faculty and staff can pose questions to the PC community and dialogue forms from there. One of the questions posted recently was \"Name a time where you‘ve felt empowered or represented by an educator.\" What question would you like to pose to the PC community and why?"], ["Select-A-Prompt", "If you could have a theme song, what would it be and why?"]]], [147, [["Additional Info Short Response", "The University of San Diego offers diverse educational opportunities grounded in the liberal arts and sciences. First-year students are immersed in one of our five Living Learning Communities (LLC), with the themes reflecting the vitality of the liberal arts tradition: Advocate, Collaborate, Cultivate, Illuminate and Innovate. Select one of these five themes and describe how it resonates with you and why."], ["Select-A-Prompt", "Here at USD, we believe that our campus community and the communities we engage with are integral parts of who we are as a university. Our newly launched Horizon Project is a call to action, ensuring that we are dedicating the time, energy and resources necessary to build an ever more diverse and inclusive campus community. We value the fact that our students come from all walks of life, have experienced different realities and bring with them an array of unique perspectives, including some that have often been underrepresented and underserved by higher education. With that context in mind, what contribution have you made to your current school and/or local community that best exemplifies your awareness of and commitment to creating a diverse, inclusive and equitable community?"], ["Select-A-Prompt", "USD is a proud Changemaker Campus, as designated by Ashoka U. As such, the USD experience emphasizes changemaking through social justice efforts, civic engagement, social innovation, creativity and a global perspective. Use this space to write about one of the challenges facing humanity today. Why does it matter to you? What experiences or insights have you had that speak to the urgency of this issue?"], ["Select-A-Prompt", "Because USD is a contemporary Catholic university, we welcome and celebrate students from every background and faith tradition, including those who do not identify with a faith tradition. We devote great time and energy to ensuring all students feel connected to the vibrant USD community, including opportunities to grow in their relationship with God while considering who they are, what they believe and who they are called to become. Share some of your ideas about the role of faith or spirituality in your life or the life of someone you know."]]], [153, [["Community Service Essay", "At Fordham, we expect students to care for and engage with their communities. Please share a specific instance in which you challenged yourself or stepped out of your comfort zone in order to impact your community (for example, your family, friend group, high school, or town). Or, share a way you hope to do so at Fordham."]]], [156, [["Overcoming Challenges Essay", "Florence Caldwell was the first woman to graduate from Mines. She enrolled in 1895 and found that her fellow classmates discouraged her attendance. She persevered through that discouragement and graduated with a degree in Civil Engineering in 1898. She was described as a problem solver who was loyal, kind and sympathetic to others and displayed unwavering courage. Describe a time when you overcame an obstacle, persevered through a situation or displayed characteristics similar to Florence Caldwell."], ["Why This College Essay", "Please tell us why Mines is the best fit for you or tell us something about yourself that you feel the rest of your application does not communicate."]]], [157, [["Extracurricular Short Response", "Please briefly elaborate on one of your extracurricular activities or work experiences."]]], [158, [["Extracurricular Essay", "Please briefly elaborate on one of your extracurricular activities or work experiences."]]], [161, [["Nursing Majors Essay", "What experiences have led you to choose the field of nursing? Why do you believe nursing is a good career path for you?"], ["Select-A-Prompt", "Please share an experience that made you feel uncomfortable or challenged, and then explain how you grew from the situation."], ["Select-A-Prompt", "Please share an experience you have had outside of the classroom that has contributed to your personal growth."]]], [164, [["Why This College Essay", "Please describe your specific interest in attending Illinois Wesleyan University."]]], [169, [["Why This Major Short Response", "As you know, the academic programs at Emerson College are focused on communication and the arts. Please tell us what influenced you to select your major. If you‘re undecided about your major, what attracted you to Emerson‘s programs? Please be brief (100-200 words)."], ["Honors College Essay", "We often use metaphors to help us understand our world and persuade others. Write about a metaphor that you think is powerful, and explore its potential to be helpful and/or harmful in your thinking."], ["Select-A-Prompt", "\"Much of the work that students do at Emerson College is a form of storytelling. If you were to write the story of your life until now, what would you title it and why?\""], ["Select-A-Prompt", "“At its best, how does community benefit the individual, the whole, or both?”"]]], [172, [["Business Scholars Essay", "Exploration, perpetual learning and development, and a passion for the world of business are essential traits of Business Scholars. Describe a time in your life when you experienced something impactful, challenging, or new and how that experience encouraged you to be the person you are today and will help you be successful in business."], ["Praxis Lab Essay", "The Honors College at the University of Utah offers the nation‘s only Praxis Labs. Honors College Praxis Labs gather students from different majors to collaborate on innovative project-based solutions to big societal challenges. Students in these classes analyze a topic through in-depth classroom and field research such as lectures, panels, one-on-one interviews, readings and off-campus trips. After problems have been identified, students work together to put their solutions and ideas into action in the community."], ["Why This College Essay", "(In 50 words) What is it that interests you about the Liberal Arts and Sciences education (hint: look this term up) offered by the Honors College?"]]], [173, [["Why This College Short Response", "Please tell us why you want to attend UMass Amherst?"], ["Why This Major Short Response", "Please tell us why you chose the Majors you did?"]]], [176, [["Why This College Essay", "Why are you interested in The College of Wooster?"]]], [177, [["Extracurricular Short Response", "Please briefly elaborate on one of your extracurricular activities or work experiences."], ["Community Service Short Response", "Clark is known for being a rigorous academic climate that is also equally committed to being a kind and supportive community. Please describe a time in school where someone helped you become a better learner and/or a better version of yourself."], ["Additional Info Short Response", "If there are any inconsistencies within your academic record that you would like to explain, please do so here."]]], [178, [["Extracurricular Short Response", "List any formal leadership positions and/or leadership qualities/experience you have."], ["Additional Info Short Response", "List your significant academic achievements/honors/awards."], ["Extracurricular Short Response", "List your volunteer activities during high school."], ["Extracurricular Short Response", "List your extracurricular activities, like student organizations, sports, or arts."], ["Extracurricular Short Response", "List your work experiences. You must provide the dates (duration) of each experience and indicate whether it was full-time, part-time, or for summer only."], ["Additional Info Short Response", "List any other activities or information you would like The University of Alabama to know about."], ["Additional Info Short Response", "Explain any extraordinary circumstances or special needs (for example: family situation, medical history, financial circumstances)."]]], [179, [["Extracurricular Essay", "Please briefly elaborate on one of your extracurricular activities or work experiences."], ["Why This College Essay", "Why are you interested in Illinois Institute of Technology?"], ["Why This Major Essay", "Tell us why you are pursuing your selected major. If you are undecided on a major tell us about the academic areas of interest to you."]]], [182, [["Select-A-Prompt", "Why Lawrence? \n<br />It‘s a short question seeking a short answer: 47 well-chosen words (give or take a few) will do. To prompt your thinking, what appeals to you about Lawrence, and how might it fit with your interests or aspirations?"], ["Select-A-Prompt", "The Chandler Senior Experience is where Lawrentians get to show the world what they’ve learned in their major (or majors). Every graduating senior creates something significant—an independent or collaborative research project, art exhibition, scholarly paper, or senior recital. \n<br />Imagine you are in your final year at Lawrence, and you’re preparing for your Chandler Senior Experience … what would you create?"]]], [183, [["Nontraditional Path Short Response", "If you are not currently attending school, describe what you are doing."], ["Faith Short Response", "In light of your faith in Jesus, what values and personal character traits are becoming more or less important to you?"], ["Community Covenant Essay", "If applicable, please explain any questions, reservations or disagreements regarding the Community Covenant."], ["Select-A-Prompt", "Representing all members in the body of Christ who are uniquely, fearfully, and wonderfully made in the image of God [Genesis 1:26-28; Psalm 139:14; Galatians 3:28-29]"], ["Select-A-Prompt", "Creating a campus climate where all faculty, staff, students, and alumni are included as full participants who feel welcomed, respected, valued, and supported [James 2:1-4; Romans 15:7]"], ["Select-A-Prompt", "Acting for what is righteous, equitable, and fair in our life together [Psalm 89:14; Micah 6:8; Matthew 23:23; Luke 10:25-37]"], ["Select-A-Prompt", "Living and striving together in the Holy Spirit to become one in faith, affection, and goals to fortify the Body of Christ [1 Corinthians 1:10; Ephesians 4:1-16; Psalm 133:1-3; John 17:20-23]"]]], [185, [["Additional Info Essay", "If appropriate, please provide a statement of any special or unusual circumstances that you think should be considered when evaluating your Application for Admission."], ["Additional Info Essay", "You may use the space below to provide additional details not reflected in your application that you feel are important in the decision making process. Some examples might include:\n<br />- Explanation of extended absence from school\n<br />- Explanation of unusual grade trends\n<br />- Any items/information not included in other parts of the application"]]], [186, [["Why This College Short Response", "Why are you interested in Wofford College?"]]], [190, [["Community Service Essay", "Most people belong to many different communities; groups defined by (among other things) shared geography, religion, ethnicity, income, cuisine, interests, race, ideology, or intellectual heritage. Choose one of the communities to which you belong and describe that community and your place within it."]]], [193, [["Why This College Short Response", "Why have you decided to apply to Creighton University?"]]], [195, [["Joy Short Response", "What brings you joy?"], ["Hometown Short Response", "We’re in your hometown. Where should we eat and what should we order?"], ["Playlist Short Response", "Name three songs from your perfect playlist."], ["Hope Short Response", "As you look into the future, what gives you hope?"]]], [197, [["New Course Short Response", "If RIT could create any course tailored to your interests, what would that course be about and what would you give as its title?"]]], [198, [["Why This Major Short Response", "Describe your academic and career plans and any special interest (for example, undergraduate research, academic interests, leadership opportunities, etc.) that you are eager to pursue as an undergraduate at Indiana University. Also, if you encountered any unusual circumstances, challenges, or obstacles in pursuit of your education, share those experiences and how you overcame them. (200-400 words)\n<br />This essay may be used in scholarship consideration."]]], [200, [["Select-A-Prompt", "Why UVM? "], ["Select-A-Prompt", "Established in 1978 in a renovated gas station in Burlington, VT, Ben and Jerry’s is synonymous with the ice cream business. The company’s success and unique brand identity are due in part to their one-of-a-kind flavors. Which Ben &amp; Jerry’s ice cream flavor (real or imagined) best describes you? "], ["Select-A-Prompt", "Whether they are constructing a robot, a stronger sense of community or an identity, UVM students are builders. What would you like to build? "], ["Select-A-Prompt", "At UVM, learning extends far beyond the walls of our classrooms. From student-led organizations, to internships and study abroad experiences, UVM students are encouraged to pursue knowledge in all environments. Describe a time when you’ve learned in a non-traditional setting. "], ["Select-A-Prompt", "Communities and organizations are stronger when they value diversity of thought. How do you create meaningful connections or conversations with others when they express opinions that differ from your own?"]]], [204, [["Why This College Short Response", "What about St. John’s interests you most?"], ["Background Short Response", "Share with us any aspect of your personal or family story relevant to understanding who you are today or who you want to be in the future. "], ["Questions for Us Short Response", "Do you have any questions about the college or your application? "], ["Great Books Essay", "Discuss a book that you consider great. We want to learn both about the ideas in the book and about you. What makes this book great in your view? What effect has it had on what you think or how you think? "]]], [205, [["Identity Essay", "Tell us something meaningful about yourself that is not reflected in your application.  You may choose to speak about your interests, aspirations and/or background."], ["Overcoming Challenges Essay", "It is often said that the road to success is paved with setbacks.  Tell us about a time you faced a challenge or obstacle.  What did you learn from it, and how did it contribute to your success?"], ["Open-ended Essay", "Share an essay on any topic.  You may use an essay that you have previously written or one that discusses a topic of your choice."]]], [206, [["Community Service Short Response", "The University of San Francisco‘s Jesuit tradition emphasizes community engagement and education for social justice, inspiring our students to become passionate agents for others. How do you see yourself becoming a part of this mission?"]]], [208, [["Select-A-Prompt", "Describe a specific accomplishment or experience and its influence on you.\n<br />Tell us about a time where you had to either take a risk or stay safe. What did you do? What happened? Would you do it again?"], ["Select-A-Prompt", "If you were limited to just one person to get advice from, tell us who you would choose and why."], ["Select-A-Prompt", "Describe one thing about you we should know that we won’t find elsewhere in your application."], ["Select-A-Prompt", "Discuss an event or situation that reinforced the importance of diversity to you."]]], [210, [["Why This College Essay", "Why are you interested in The College of New Jersey?"]]], [212, [["Why This Major Short Response", "We‘re committed to supporting you in energizing your learning experiences so you can go further than you imagine. Please tell us why you selected-and how you see yourself growing in-this specific academic program. "]]], [214, [["Why This College Essay", "The Code of Love and Honor is a personalized pledge derived from our Values Statement. Its first line is \"I am Miami,\" signifying that each and every one of us, through our choices, and supporting and caring for each other, contributes to who we are and what we aspire to be — individually, yes, but also collectively — as Miamians."]]], [215, [["Select-A-Prompt", "Sarah Lawrence students are often described as hyphenates: director-playwright-sound designer, environmentalist-photographer, journalist-linguist, economist-poet. In 250-500 words, tell us about seemingly disparate interests you‘ve brought together, or hope to bring together at Sarah Lawrence."], ["Select-A-Prompt", "Students at Sarah Lawrence are asked to design their own research questions and answer them during semester-long projects. In 250-500 words, thoughtfully respond to a prompt of your own creation."], ["Select-A-Prompt", "Sarah Lawrence College‘s community places strong value in inclusion and diversity. In 250-500 words, tell us about what you value in a community and how your perspective, lived experiences, or beliefs might contribute to your College community."], ["Select-A-Prompt", "In her 2019 commencement address, Maggie Haberman ‘96 told the graduating class ‘My time at Sarah Lawrence helped me understand the importance of patience, of assuming good faith in others, and of finding truth.‘ In 250 - 500 words, tell us about a time you spoke your own truth or found the importance in one of the values Maggie describes."]]], [216, [["Extracurricular Short Response", "Please briefly elaborate on your community service or one of your extracurricular activities."]]], [219, [["Why This College Essay", "What are the characteristics of Berry College which lead you to apply (maximum 500 words)?"]]], [225, [["Why This Major Short Response", "What are your principal areas of academic interest? What are your career goals?"], ["Extracurricular Short Response", "What are your areas of interest and involvement in and outside of school?"], ["Community Service Short Response", "What service and leadership experience have you engaged in through school or the community?"], ["Select-A-Prompt", "The Constitution of the United States currently has 27 amendments. What should be the 28th Amendment and why?"], ["Select-A-Prompt", "What event, either in the past or a realistic future, do you wish you could witness? Please explain why you chose this event."]]], [226, [["Why This College Essay", "What do you feel will be the key factor(s) in making your college choice?"]]], [228, [["Why This Major Essay", "Why did you apply to each of the academic programs listed on your application? This personal statement should provide additional information not already referenced in your application."]]], [230, [["Why This College Short Response", "Briefly and specifically tell why you have decided to apply to Centre?"]]], [231, [["Why This College Essay", "Students have many choices in their college search and application process. Please share why you have chosen to consider Stonehill among your possible college options. "], ["Object Essay", "Pick an object in your living space that captures something important about your personality, values, or background and write a short essay that describes the object and explains what it means to you and/or reveals about you. This doesn’t need to be an unusual or fancy object; it can be anything that is meaningful to you in some way. As we evaluate your essay, we are looking for clear writing, interesting thinking, and a sense of who you are—of what interests, informs, and motivates you—as a learner and a person."]]], [233, [["Creative Essay", "If any of these three inanimate objects could talk, how would your room, computer or phone describe you? (500 words or less)"]]], [236, [["Extracurricular Essay", "Please elaborate on one of your extracurricular activities or work experiences"]]], [237, [["BA/BS+MD Early Assurance Essay", "Tell the Admission Committee why you are applying to the joint program with the Drexel University College of Medicine. Be sure to explain why you want to be a physician and, more specifically, why you want to obtain your medical education at the Drexel University College of Medicine. "], ["Westphal College Majors Essay", "Please write a short essay describing why you are interested in pursuing your major of choice at Drexel University‘s Westphal College. What have you done that prepares you to study in your major of choice?"]]], [240, [["Additional Info Essay", "If you were having a personal interview with members of our admissions staff, what information would you want them to know about you? You can include your academic interests, achievements, involvement in school and the community, important personal experiences, obstacles you’ve overcome, and other aspects of your background."], ["Additional Info Essay", "Please provide a personal statement with general information about yourself, your background, educational goals, professional aspirations, interests and the reasons you are applying for a scholarship. \n<br />Also provide other such information that will be of benefit to the Scholarship Committee, including a statement concerning your financial need or special circumstances, if applicable."]]], [243, [["Why This College Short Response", "Please tell us why you are applying to UP."], ["Extracurricular Short Response", "Please briefly describe one of your extracurricular activities or work experiences."]]], [246, [["Personal Statement Essay", "This is the space for you to tell us more about yourself. Feel free to use this space to explain any circumstances that may have affected you and cannot be found on your high school transcript. Your personal statement should be no more than 500 words. "], ["Select-A-Prompt", "Critically discuss why you believe what you believe about social justice. Using one specific example from your life, how do you anticipate that your future will be connected to social justice issues?"], ["Select-A-Prompt", "Which is the better approach - focusing on what is going right or focusing on what is going wrong? Justify your answer using one specific example from your life."], ["Select-A-Prompt", "Think of your personal and career aspirations. Using a specific example from your life, discuss the implications of changing demographics for your future."], ["Select-A-Prompt", "Choose one specific example from your life to explain how science AND literature can be used to address a current problem. "]]], [247, [["Why This College Essay", "Why are you applying to Hofstra?"]]], [248, [["Why This College Short Response", "Why do you do what you do? Briefly describe your varied interests and talents and how they will fit at Allegheny in two or three sentences."], ["Extracurricular Short Response", "Please briefly elaborate on one of your extracurricular activities or work experiences."]]], [249, [["Diversity Essay", "It is important to St. Thomas that everyone understands the role they play in creating an inclusive environment on campus and in the broader community. Please share your thoughts and personal experience with diversity, equity and inclusion. Address topics like socioeconomic status, race, ability, sexual orientation or other examples. Most importantly, speak from the heart."]]], [250, [["Healthcare Majors Short Response", "Why do you have an interest in the specific health care major you are applying to? Please discuss any experiences you have had in this field."]]], [251, [["Why This College Essay", "Why Ursinus College?"]]], [253, [["Overcoming Challenges Short Response", "Tell us your story. What unique opportunities or challenges have you experienced throughout your high school career that have shaped who you are today?"], ["Background Short Response", "Most students have an identity, an interest, or a talent that defines them in an essential way. Tell us about yourself."], ["Why This Major Essay", "Please state educational and career goals and the reason for choosing your major."], ["Financial Need Essay", "Briefly describe any financial need circumstances you would like for the scholarship committees to consider."], ["Why This College Essay", "Why have you chosen to apply to Texas Tech University?"], ["Diversity Essay", "Please describe any special contributions you would make to Texas Tech University and your academic program? (First generation college student, record of overcoming adversity, special accomplishment, etc.)"]]], [254, [["Community Service Short Response", "The Honors College develops leaders who are engaged members of their community and profession. How have you been of service to your community and what has that taught you about being a leader? How will you contribute to the Honors community?"], ["Accelerated Program Short Response", "Why do you want to pursue an accelerated program in medicine, law, dentistry, optometry, physical therapy or physician assistant, and what academic, educational or other experiences have provided you with a foundation for the accelerated program?"]]], [255, [["Criminal Activity Essay", "Only required if you answer yes to being suspended for sexual violence. Please provide the details of your suspension and reflect on what you learned from the experience."], ["Criminal Activity Essay", "Only required if you were convicted of a felony. Please provide the details of your criminal conviction or adjudication and reflect on what you learned from the experience."]]], [256, [["DPT Program Essay", "If you wish to be considered for the Doctor of Physical Therapy program, please share why you are interested in physical therapy as a profession and what experiences have led you to this interest. If you wish to be considered for the Master of Athletic Training program, please share why you are interested in athletic training as a profession and what experiences have led you to this interest."], ["Criminal Activity Short Response", "Only required if you answer yes to being dismissed from school for disciplinary reasons: Please explain your dismissal. Please include semester(s) of occurrence, frequency, detailed explanation, and disciplinary action taken."]]], [260, [["Community Service Essay", "As you can see from the Simmons website, leadership is central to our mission. Honors students in particular naturally gravitate toward leadership positions on campus and in the surrounding community. Pick one organization at Simmons or in the local Boston community that you would like to get involved in, and tell us how being of a member of the Honors Program will be beneficial to you in this role."], ["3+1 LIS Program Essay", "Why are you interested in the 3+1 LIS program, and how will a Bachelor‘s in Computer Science or Information Technology help you reach your Library Information Science career goals?"], ["Accelerated Combined Engineering Program Essay", "Please explain your interest in pursuing an engineering career, and what makes you a strong candidate for the accelerated 3+2 Combined Engineering Dual-Degree Program at Simmons and Columbia."], ["Accelerated Public Policy Program Essay", "What is public policy and why do you want to study it in an accelerated program?"], ["Social Work Program Essay", "Why are you interested in becoming a social worker?  What experiences have you had that prepare you for this program? What do you hope to gain from an accelerated BSW/MSW program, and how do you plan to manage the accelerated pace of this program?"], ["Select-A-Prompt", "U.S. citizens are now living in an era that has been referred to as an era of \"racial reckoning.\" What does that term mean to you? How do you think your college experience might change and/or deepen your views on race?"], ["Select-A-Prompt", "What have you learned about yourself, both as a student/learner and as a person, from your experiences during the pandemic? How might those lessons translate to your ability to succeed at Simmons and in the Honors Program?"]]], [261, [["Why This College Short Response", "Located in one of the world‘s top cities for technology and innovation and deeply rooted in 500 years of Jesuit tradition, a Seattle University education is progressive, global and holistic. We encourage students to challenge preconceived notions, reflect before they react, and strive for the greater good. What is it that drew you to apply to Seattle University? Where do you hope a Seattle University education will take you?"], ["Rice/Baylor Medical Scholars Short Response", "The Business and Law program at Seattle University is a competitive dual degree in which students can earn both a Bachelor of Arts in Business Administration and Juris Doctor (law) degree in a six-year span (instead of the traditional seven). Why are you applying to the Business and Law program at Seattle University and what experiences have prepared you to be successful for the rigor and accelerated pace of the program? You may highlight prior influences or internship experience as well as future career goals and aspirations. Please limit your response to 500 words."], ["Select-A-Prompt", "What is a community that you belong to and a positive change you would like to affect within that community?"], ["Select-A-Prompt", "Seattle is one of the best music cities on earth and SU students love discovering new Seattle music. Please share one song that reflects who you are today and another that reflects who you want to be. Share the songs, artists and why you chose each one."], ["Select-A-Prompt", "Seattle has a dynamic, global food scene that has been shaped by the many communities that call Seattle home. Share a food dish that has helped to inform and shape your identity."]]], [264, [["Select-A-Prompt", "“I have no special talents. I am only passionately curious.” – Albert Einstein"], ["Select-A-Prompt", "Writing, painting, performing, debating, and designing solutions to complex equations are only a few of the media through which people convey their thoughts, emotions, and aspirations. How do you express the inner workings of your mind to the larger world? How does the world around you respond?"]]], [265, [["About You Essay", "Tell us your story.  Include any details that will help our team get to know you.  Be as creative in your writing as you like."]]], [266, [["Diversity Short Response", "Social identity (e.g., nationality, ethnicity, race, gender, or religion) and cultural identity (e.g., traditions, heritage, language, aesthetics, norms, and customs) play an important role in how we understand ourselves and each other. Please share what social identity or cultural identity means to you or about a time you explored an identity different from your own."], ["Why This College Essay", "What factors influenced you to apply for admission to Hope College?"]]], [267, [["Why This College Short Response", "Why Bard?"]]], [273, [["Diversity Short Response", "At the University of Colorado Boulder, no two Buffs are alike. We value difference and support equity and inclusion of all students and their many intersecting identities. Pick one of your unique identities and describe its significance."], ["Why This Major Short Response", "Please share a bit more about your academic interests. What do you hope to study at CU Boulder? What has inspired your interests in this area? Or if you are undecided, what area(s) of study are you considering? Think about your prior/current coursework, extracurricular activities, work/volunteer experiences, future goals, or anything else that has shaped your interests."]]], [276, [["Describe Yourself Short Response", "Our students and faculty use words like “original,” “resilient,” “creative,” “compassionate,” “global,” “fierce,” and “unexpected” to describe Beloiters and our campus. What are five words that describe you? No essay required, just words."], ["Meaningful Number Short Response", "At Beloit, we want to get to know you beyond the numbers of your GPA or test scores. In one sentence, share a number of something we wouldn’t necessarily read about in your application and why it matters to you--for example, the number of times you’ve watched your favorite movie, or your lucky number...surprise us!"], ["Meaningful Phrase Short Response", "“We Find A Way.” For Beloit College, it’s not just a slogan; it’s how the college has transformed over our 175 year history, and it’s how our students aspire to make an impact on the world. What is one word, slogan, or phrase that keeps you inspired?"]]], [280, [["Why This College Short Response", "In 250 words or less, please share why are you interested in attending Saint Anselm College."]]], [281, [["Why This College Essay", "Please share why the Christian emphasis at Union University appeals to you."], ["Additional Info Essay", "Summarize your personal relationship with Jesus Christ."]]], [282, [["Criminal Activity Short Response", "Have you ever been found responsible for a disciplinary violation at any education institution you have attended from 9th grade (or international equivalent) forward, whether related to academic misconduct or behavioral misconduct, that resulted in a disciplinary action? Please explain, if necessary."]]], [283, [["Why This College Essay", "Why do you think Earlham is a good fit for you?"]]], [284, [["Community Service Essay", "Reflect on what elements of your home, school, or community have influenced you as an individual. In the space below, please describe how these experiences, whether it is leadership opportunities, volunteer service, or life circumstances have impacted you and will help you enhance the community at Nebraska."]]], [292, [["Why This College Short Response", "Please describe why you are interested in attending UNC Wilmington."], ["Additional Info Essay", "Details for interruption of education:"]]], [293, [["Liberal Arts Short Response", "Hillsdale’s classical liberal arts curriculum teaches students “the best that has been thought, written, and said” throughout Western history and across disciplines. How do you hope this approach to education will prepare you for life after college?"], ["Why This College Essay", "Since its founding in 1844, Hillsdale College has aimed to develop the minds and improve the hearts of its students. How will your partnership in our community aid us in this work?"]]], [300, [["Why This College Short Response", "Saint Mary’s College of California is guided by the five Lasallian Core Principles. Which core principle inspires you most, and why?"], ["Influential Figure Essay", "If you had the opportunity to meet any person for coffee—past or present, fictional or nonfictional—who would it be and why?"]]], [301, [["Spiritual Growth Short Response", "At Biola University our common foundation is our faith in Christ and looking to the Bible as a source of knowledge, truth, and inspiration. In at least 375 words, 1. Describe how and when you made a decision to follow Christ 2. Using personal examples, share about your spiritual growth over the past 3 years."], ["Why This College Essay", "Additionally, in 50 words or less, please share why you‘re interested in attending Biola University."], ["School of Cinema and Media Arts Short Response", "Please describe yourself as fully and accurately as possible in the 180-character limit of a classic tweet.*"], ["School of Cinema and Media Arts Essay", "Your personal statement should be something about yourself, telling a story of how you came to be interested in media, how faith plays a part in your creative life and what you hope to accomplish after college."], ["School of Cinema and Media Arts Essay", "By this part of your college application process, you will have probably written dozens of essays and responded to a multitude of questions. Use this opportunity to add anything else you would like us to know about you."], ["School of Cinema and Media Arts Essay", "Why did you choose to also apply to the Cinema and Media Arts program at Biola University?"], ["Faith Short Response", "Who is Jesus Christ? How do you use the Bible to answer this question?"], ["Books Short Response", "Other than the Bible, what 2-3 books have challenged the way you think about yourself and/or the world? Describe how."], ["Academic Interest Short Response", "What is an idea that you‘re looking forward to studying more deeply? Why?"], ["Overcoming Challenges Essay", "How do you approach difficulties in your life, and what wisdom have you gained?"], ["Overcoming Challenges Essay", "Describe a time in which you handled a meaningful disagreement."], ["Why This College Essay", "What is it about Torrey Honors that leads you to believe that you will thrive in our program?"], ["Select-A-Prompt", "Pick a movie, novel, or game where the protagonist makes a difficult choice. What did you learn from watching this journey?*"], ["Select-A-Prompt", "What matters to you, and why?"], ["Select-A-Prompt", "Media production is a collaborative art. What contributions do you feel you can make to a creative community?"], ["Select-A-Prompt", "Give us your top 10 list (this is an intentionally unrestricted question)"]]], [302, [["Extracurricular Essay", "Please briefly elaborate on one of your extracurricular activities or work experiences."], ["Why This College Essay", "Briefly describe why you are interested in attending Lipscomb and what specific factors have prompted you to apply."], ["Why This Major Essay", "n two to three sentences, please tell us about your career goals and why you are inclined towards that profession. If you are uncertain, please describe to us what you may be considering in a professional capacity and why."]]], [304, [["Why This College Short Response", "Describe how your personal faith and beliefs contribute to your college search process. (Examples include reasons for choosing Liberty, background information about your personal faith and beliefs, or other information you deem relevant.)"], ["Faith Short Response", "Liberty’s mission is to develop Christ-centered leaders. Describe how you will contribute to this mission as a Liberty student. (Examples include interests in church or community service, personal achievements or goals, or other examples of what you hope to achieve as a student.)"]]], [305, [["Why This College Essay", "Why Lake Forest?"]]], [312, [["Academic Goals Short Response", "What are your academic goals?"]]], [313, [["Why This College Short Response", "Why are you interested in Maine Maritime?"]]], [315, [["Why This College Short Response", "Appalachian State University prepares students to lead purposeful lives as engaged global citizens who understand their responsibilities in creating a sustainable future for all. \n<br />Our students think critically, communicate effectively, make local to global connections, and understand the responsibilities of community engagement. We embrace our obligation to help create healthy, just, and sustainable societies by equipping our students to live with knowledge, compassion, dedication, humility, and dignity.\n<br />After reviewing our institutional mission statement, please describe why you are interested in attending Appalachian State. Your response is an important factor in distinguishing an admissible candidate within our applicant pool. You can type directly into the box or you can paste text from another source."]]], [317, [["Why This College Essay", "Please explain why you have included the University of Redlands."], ["Diversity Essay", "University of Redlands values diversity in many ways. We aim to educate the hearts and minds of our students and to create a welcoming space for all, recognizing that the unique experiences and perspectives of all members of our community enhance our living and learning environments. How do you see yourself contributing to our community? "]]], [318, [["Overcoming Challenges Short Response", "Dealing with adversity: Describe the most significant challenge you have faced and the steps you have taken to address this challenge. Include whether you turned to anyone in facing the challenge, the role the person played, and what you learned about yourself."], ["Honors College Short Response", "“Not everything that is faced can be changed. But nothing can be changed until it is faced.” – James Baldwin, \"As Much Truth as One Can Bear”"], ["Honors College Short Response", "Knowledge in a field/creativity: Describe any special interests and how you have developed knowledge in these areas. Give examples of your creativity- the ability to see alternatives; take diverse perspectives; come up with many, varied, or original ideas; or willingness to try new things."], ["Diversity Short Response", "The OSU Honors College would like to better understand your perspectives, contributions, qualifications, and diverse talents. Please address your experience in each category keeping in mind how what you know could contribute to the future community of excellence at OSU. Respond to the questions and limit answers to 100 words per question."], ["Honors College Short Response", "The OSU Honors College would like to better understand your perspectives, contributions, qualifications, and diverse talents. Please address your experience in each category keeping in mind how what you know could contribute to the future community of excellence at OSU. Respond to the questions and limit answers to 100 words per question."]]], [319, [["Extracurricular Essay", "Please briefly elaborate on one of your extracurricular activities or work experiences."]]], [320, [["Select-A-Prompt", "Most colleges have mottos—a word or phrase that expresses the ideals that guide their actions. Lewis &amp; Clark’s motto is Explorare, Discere, Sociare—to explore, to learn, to work together. Tell us about your personal motto and how it guides you (Latin not required).\n"], ["Select-A-Prompt", "At Lewis &amp; Clark, we strive to be an inclusive community. Reflecting on a part of your identity (for example, your culture, race, ability status, sex, gender identity/expression, sexual orientation, national origin, political affiliation, religion, age, or veteran status, etc.), share with us an experience where you engaged with difference."]]], [327, [["Select-A-Prompt", "Maya Angelou said, “I’ve learned that people will forget what you said, people will forget what you did, but people will never forget how you made them feel.” Describe a time you focused on helping others feel empowered."], ["Select-A-Prompt", "Advice is sometimes easier to give than to follow. Share a piece of advice you ignored and why you should have followed it. What happened?"], ["Select-A-Prompt", "Describe an experience that changed your life. What did you learn? How will this experience influence you moving forward?"], ["Select-A-Prompt", "Stan Lee once said, “If you‘re writing about a character… unless you give him vulnerability, I don‘t think he‘ll be as interesting to the reader.” What makes you feel vulnerable and how has it shaped your personality?"]]], [328, [["Faith Short Response", "Why are you interested in attending a faith-based university that affirms and integrates Christian beliefs?"]]], [330, [["Previous Academic Essay", "To be considered for the Honors Program, please provide an academic essay that best represents your writing ability. A class writing assignment or an essay of your own design is acceptable. Explain the original assignment (if appropriate) for your essay and the reasons you have chosen to include it."]]], [332, [["Tell Us a Story Essay", "The Robert D. Clark Honors College (CHC) endeavors to be a diverse and inclusive place. The faculty are involved in the review of applications and are eager to learn about how you think, and how your mind works. The best essays will demonstrate effective storytelling, include thoughtful analysis, synthesize themes in a meaningful way, and give us a sense of your personality and perspective."], ["Special Circumstances Essay", "This section can be used for various purposes, and gives you an optional opportunity for discussing any of the following. "], ["Select-A-Prompt", "Describe an experience with discrimination, whether it was fighting against discrimination or recognizing your contribution to discriminating against a person or group. What did you learn from the experience? In what ways will you bring those lessons to the University of Oregon?"], ["Select-A-Prompt", "The University of Oregon values difference, and we take pride in our diverse community. Please explain how you will share your experiences, values and interests with our community. In what ways can you imagine offering your support to others?"]]], [338, [["Select-A-Prompt", "If you could pursue one passion for the rest of your life, what would it be?"], ["Select-A-Prompt", "In a book about you, what chapter would you tell us to read? And why?"], ["Select-A-Prompt", "Tell us about a project that you started, on your own, just because it needed to be done."], ["Select-A-Prompt", "What‘s a significant obstacle that you are proud to have overcome?"]]], [339, [["Why This College Essay", "We want to know you—how you have developed academically and spiritually, what‘s important to you, and how you imagine contributing to the Taylor community. We are especially interested in knowing how God is working in and through you. Other applicants may have similar credentials, but none have your particular experiences. Your story is unique. Tell us how you‘ve seen God working in your life, whether through a specific circumstance or in the grand scheme, and tell us why Taylor‘s discipleship community appeals to you. Your story should be between 400 and 700 words."], ["Extracurricular Short Response", "We’re curious about your passions. List up to three extracurricular, community, church, volunteer, work, or travel experiences."]]], [341, [["Talent Development Program Essay", "Talent Development Supplemental Statement: Please provide a statement of 250 words or fewer describing the obstacles or circumstances which have led you to apply to The Talent Development Program."], ["Why This Major Short Response", "Six-year Doctorate in Pharmacy Applicants: Please provide a statement of 250 words or fewer explaining why you have chosen this major."], ["Why This Major Short Response", "Nursing Applicants: Please provide a statement of 250 words or fewer explaining why you have chosen this major."]]], [344, [["Why This College Short Response", "Please tell us why you chose to apply to Agnes Scott College?"], ["Leadership Short Response", "At Agnes Scott, we believe that leadership is more than position. Describe at least one quality of leadership that you have learned in high school, either through direct experience or by observation of another leader?"], ["Global Issue Short Response", "What global issue can you imagine yourself addressing during your time at Agnes Scott?"], ["Community Service Short Response", "If you are involved in community service, what project has been your favorite and why?"], ["Travel Short Response", "If you could visit anywhere, where would you go and why?"], ["Favorite Book Short Response", "What‘s your favorite book you have read outside the classroom (not assigned reading) and why?"], ["Additional Info Short Response", "Are you interested in participating in: Basketball, Softball, Cross Country, Tennis, Volleyball, Soccer? List and rank the sport(s) in order of priority."], ["Additional Info Short Response", "Please indicate your current experience for your number one sport choice."], ["Leader Short Response", "Tell us about a leader that you admire. Who are they? How have they influenced you?"]]], [346, [["Why This College Essay", "What factor(s) led you to apply to Springfield College?"]]], [347, [["6-Year PharmD Program Short Response", "Please submit a brief 250-word essay discussing your reasons for choosing a career in pharmacy and why you are applying to St. John‘s University."]]], [350, [["Certain Theatre Majors Short Response", "Discuss an experience that sparked your interest in this field. (Required for applicants to theatre and electronic media performance or theatre and entertainment technology; may* be required for applicants to audio production and technology or sound design.)"], ["Certain Theatre Majors Short Response", "What do you hope to do after college? (Required for applicants to theatre and electronic media performance or theatre and entertainment technology; may* be required for applicants to audio production and technology or sound design.)"]]], [354, [["Extracurricular Essay", "Please briefly elaborate on one of your extracurricular activities or work experiences."], ["Why This College Essay", "Why are you interested in Norwich University?"]]], [361, [["Why This College Essay", "The University at Albany is noted for attracting students who seek careers that will enable them to lead and to serve. Please share in one or two paragraphs how you believe a UAlbany education would empower you to achieve your goals."]]], [363, [["Why This College Essay", "Why are you interested in Elizabethtown College?"], ["Why This Major Essay", "Discuss your reason(s) for pursuing your intended major and pre-professional goals."]]], [365, [["Select-A-Prompt", "The Kansas state motto “Ad Astra per Aspera” is Latin for “To the Stars through Difficulties.” What stars are you aiming for, and how have you learned/prepared to face challenges along the way? "], ["Select-A-Prompt", "There are many questions to ask and problems to explore. If you were to choose a question, problem, idea, or issue (personal, systemic, local, or global) to explore during your undergraduate years at KU, what would it be? What might you create, design, invent, or engineer to explore this topic? "], ["Select-A-Prompt", "As Jayhawks, our community is committed to a set of core values: To actively foster unity, strive for innovation, advocate for inclusion, and value engagement. Community might refer to your cultural group, extended family, religious group, neighborhood or school, sports team or club, co-workers, etc. Describe the world you come from and how you, as a product of it, might add to the KU community."], ["Select-A-Prompt", "Help us learn about you, your life, and your experiences. List no more than five items (clubs and organizations, work experience, community service, awards and recognition, extra-curricular interests, personal or family obligations, etc.) in descending order of significance (list the most significant item first). For each item, explain your role, time commitment (both amount of time you devote to the activity and the year(s) in which you were involved), and responsibilities. "], ["Select-A-Prompt", "How have your experiences affected your sense of who you are and what you hope to accomplish? There are no wrong answers. "], ["Select-A-Prompt", "The Honors Program intends to attract students who make the most of the opportunities available to them. Based on the availability of courses at your school, how did select the courses you chose to take? Is there anything you want the admissions committee to know about your transcript?"]]], [366, [["Why This College Essay", "In as many or as few words as you would like, please tell us why you‘re interested in attending Willamette University."]]], [367, [["Why This College Short Response", "Please describe why you are interested in attending UNC Charlotte. Your statement lets us get to know you beyond your coursework and test scores. Your response will distinguish you from other qualified candidates within the applicant pool."], ["Additional Info Essay", "Please explain the reason(s) you have not been enrolled below. Please be as thorough as possible."]]], [368, [["Additional Info Short Response", "If your cumulative GPA is below 3.0/B- average (on a 4.0 scale), if you have any D or F grades, or if you are missing units in our CSU Recommended Courses, this is your opportunity to explain.  Tell us about the situation and/or what happened, what you did to fix it, and how your experience will help you be academically successful at CSU."]]], [369, [["Career Short Respone", "What are your career goals?"]]], [375, [["Character Short Response", "Character matters at Hampton University. Describe what exhibiting good character means to you and provide specific examples of your demonstrated behavior in this regard."]]], [387, [["Why This Major Essay", "Please provide an essay that explains why you chose your intended program of study. What interests you the most about this major? Please be specific - those evaluating these essays are highly interested in your response. If Undecided, what areas of study do you look forward to studying in college?"], ["Overcoming Challenges Essay", "Please describe in detail ways that you have sought out academic challenges and personal growth opportunities while in high school. Examples can include activities both inside or outside of your school."], ["Why Honors College Essay", "How will your engagement with the Honors College foster your academic, personal, and professional growth?"]]], [390, [["Additional Info Short Response", "The University of Arizona does not require a personal statement to review your application for undergraduate admission. However, if you would like to share any relevant information about your academic record that is not reflected on your transcripts including, for example, hardships you‘ve experienced, or any learning and/or attention differences, you may do so in this optional statement."]]], [391, [["Why This College Short Response", "Why are you interested in Rockhurst University?"]]], [395, [["Additional Info Essay", "What else, if anything, would you wish the Admissions Committee to know about your candidacy?"], ["Why This College Essay", "Students who have a GPA of 3.5 or higher are welcome to apply to Honors. Learn more about Honors at www.belmont.edu/honors.The deadline for application is December 1. To apply for Honors, submit a brief statement of no more than 500 words illustrating something you’ve already done or made that demonstrates your engagement in the three Honors values. Or, explain in no more than 500 words how these three values are important to your future. Make sure your brief statement explicitly focuses on our Honors values."], ["Criminal Activity Essay", "Only required if you answer yes to being convicted of a misdemeanor or felony: Please provide the details of your criminal conviction or adjudication and reflect on what you learned from the experience."], ["Criminal Activity Essay", "Only required if you answer yes to being responsible for disciplinary violation at school. Please give the approximate date(s) of each incident, explain the circumstances and reflect on what you learned from the experience."]]], [396, [["Overcoming Challenges Essay", "Think of a time when you were dealing with a challenge (personal, academic, work related). How did you handle that? Did you seek support and if so who did you seek support from?"]]], [409, [["Select-A-Prompt", "Some students have an identity, interest, or talent that is so meaningful that they believe their application would be incomplete without it. If this sounds like you, then please share your story. "], ["Select-A-Prompt", "The lessons we take from obstacles we encounter can be fundamental to later success. Recount a time when you faced a challenge, setback, or failure. How did it affect you and how did you learn from the experience?"], ["Select-A-Prompt", "Reflect on a time when you questioned or challenged a belief or idea. What prompted your thinking? What was the outcome?"], ["Select-A-Prompt", "Reflect on something that someone has done for you that has made you happy or thankful in a surprising way. How has this gratitude affected or motivated you?"], ["Select-A-Prompt", "Discuss an accomplishment, event, or realization that sparked a period of personal growth and a new understanding of yourself or others. "], ["Select-A-Prompt", "Describe a topic, idea, or concept that you find so engaging that it makes you lose all track of time. Why does it captivate you? What or who do you turn to when you want to learn more? "], ["Select-A-Prompt", "Share an essay on any topic of your choice. It can be one you‘ve already written. one that responds to a different prompt, or one of your own design. "]]], [410, [["Select-A-Prompt", "Share a personal statement, college essay, narrative, or an example of your best writing."], ["Select-A-Prompt", "Choose one of the following themes: Grit, Motivation, Intellectual Curiosity\n<br />How has this theme influenced your high school journey and how will it continue to guide you through your college journey?"], ["Select-A-Prompt", "Describe your academic challenges and your plans for succeeding in college."]]], [411, [["Additional Info Essay", "This essay is optional. You may use this space to describe any academic challenges you have faced, your preparation for success in your academic and career objectives, or any additional information that you would like to have associated with your application. Recommended essay length: 250-500 words."], ["Why This Major Essay", "Please explain why you have chosen your particular program of study."], ["Education Essay", "We expect that one reason you seek a tutorial education is for the one-on-one interaction with faculty, but other than that, what interests you about pursuing a tutorial-based undergraduate education? What aspects of your education and life experience have prepared you for a tutorial education with its emphasis on research and creative activity?"]]], [413, [["Extracurricular Short Response", "Please list your primary extracurricular and community service activities. Describe one community service activity that you have participated in that has changed your view on a particular social issue. Discuss the social issue and how your experience changed your way of thinking about it."], ["Select-A-Prompt", "How have the environments or experiences of your upbringing -- your home, neighborhood, or community -- shaped the person you are today?"], ["Select-A-Prompt", "Most of us have at least one issue or passion we care deeply about; if you had 10 minutes and the attention of a million people, what would your talk be about?"], ["Select-A-Prompt", "If these inanimate objects could speak, how would your room, car, or computer describe you?"]]], [416, [["Why This College Short Response", "Please choose the three most important factors that influenced your decision to apply and that you feel set Wagner apart from other colleges and universities. (250 words or less)"], ["Why This College Short Response", "If you have visited campus, please describe what aspect of your visit experience most positively affected your impression of Wagner. (250 words or less)"]]], [421, [["Scholarship Short Response", "What‘s your KnoX-Factor? In 200 words or fewer, tell us what makes you a compelling, interesting, person deserving of recognition with merit scholarships. "]]], [424, [["Conservatory of Music Applicants Essay", "Write an essay about your goals for your intended music major. Indicate information about your music background, personal characteristics and experiences that led to choosing this major and that you believe would contribute to your success in this area."]]], [428, [["Leadership Essay", "The University of Oklahoma believes strongly in educating leaders of communities in Oklahoma, as well as across the country and the world. Please share your leadership experiences and why they are important to you."], ["Community Service Essay", "The University of Oklahoma is home to a vibrant, diverse and compassionate University community that is often referred to as “the OU family.” Please describe your cultural and community service activities and why you chose to participate in them."]]], [430, [["Nursing Major Essay", "A one-page statement of professional goals in nursing."]]], [434, [["Why This College Short Response", "What is your motivation for pursuing higher education? Why do you believe George Mason University is the right institution for you? (Required for those applying test-optional)"], ["Select-A-Prompt", "George Mason University is Virginia‘s largest public research university. As a Tier-1 research institution, every day, our faculty, staff, and students work to address unanswered questions, unresolved challenges, and problems that impact a wide variety of populations. In the Honors College, you‘ll have opportunities to do this sort of work -- and maybe even answer questions and solve problems that matter to you. Tell us about one question, challenge, or problem that you‘d like to work to better understand or address during your time at Mason. Introduce this issue, and then explain why it matters to you and why it might matter to others. Feel free to be creative- research and inquiry can exist in unlikely places."], ["Select-A-Prompt", "The art we see, the stories we read, and the words we hear have the power to move us and to change us. Tell us about a time that you‘ve been moved to act by something you read, a speech you heard, or a work of art that you experienced. What was it, and how did it impact you? What did you do -- or what will you do -- in response?"]]], [437, [["Extracurricular Essay", "How have any activities that you have participated in shaped you?"]]], [445, [["Why This College Short Response", "Please explain, in a few sentences, your answer to the question, \"Who or what most influenced you to apply to Assumption University?\""]]], [449, [["Why This College Short Response", "In approximately 100 words, describe what has motivated you to apply to Goucher College?"], ["Additional Info Short Response", "In approximately 100 words, describe what you believe to be is the most exciting or effective learning environment for you."], ["Overcoming Challenges Short Response", "In ten words or fewer, if you could right one wrong, what would it be?"]]], [453, [["Extracurricular Short Response", "We believe that leadership comes in many forms. Whether you‘ve held\n<br />formal positions in clubs and organizations or you see yourself as a quiet\n<br />leader who leads by example, we want to hear how leadership has played a\n<br />role in your life."], ["Additional Info Short Response", "Please describe how academic engagement has played a role in your\n<br />life in high school."]]], [463, [["Why This College Essay", "What most influenced your decision to apply to the University of St. Thomas?"]]], [465, [["Select-A-Prompt", "You have a day to spend on the beach at the waterfront of St. Mary‘s College. How would you spend it, with whom, and why? "], ["Select-A-Prompt", "St. Mary‘s College community lives and learns by aspirational principles known as \"The St. Mary‘s Way \" Tell us how you can contribute to this community and what you hope to get out of your experience in the context of \"The St. Mary’s Way.\""]]], [467, [["Why This Major Short Response", "Please share a few words about your interest in the Primary Major Choice(s) you have selected above. Please limit your short answer to 1,000 characters or approximately 150 words."], ["Why This Major Short Response", "Please share a few words about your interest in the Alternate Major Choice(s) you have selected above. Please limit your short answer to 1,000 characters or approximately 150 words."]]], [471, [["Why This College Essay", "Please submit an essay discussing your reasons for choosing the specific healthcare career you wish to pursue and why you are applying to Massachusetts College of Pharmacy and Health Sciences?"]]], [473, [["Why This College Essay", "In 100 words or less please share why you are interested in applying to Endicott."]]], [475, [["Why This College Essay", "The Honors College is mission driven. Throughout their time in the Honors College, students are evaluated based upon their development in the four honors mission pillars – resilience, ingenuity, stewardship, and equity."]]], [477, [["Why This College Essay", "Why are you interested in Transylvania University?"]]], [484, [["Select-A-Prompt", "Submit a graded writing sample\n"], ["Select-A-Prompt", "If you could live your life fighting for one cause, what would it be and why?\n"], ["Select-A-Prompt", "Describe a time you did not meet expectations and what impact the experience had on you.\n"], ["Select-A-Prompt", "What gives meaning to your life?\n"], ["Select-A-Prompt", "If you wrote a letter to yourself to be opened in 20 years, what would it say?\n"], ["Select-A-Prompt", "Discuss an issue of state, national, or global concern to you.\n"], ["Select-A-Prompt", "Why write?"]]], [490, [["Additional Info Short Response", "What makes you tick?"], ["Additional Info Short Response", "If we were to mention your name to ten people with whom you are associated, what would they tell us about you? ie…what is your reputation?"], ["Why This College Short Response", "How do you envision PC helping with your long-term goals?"]]], [496, [["Extracurricular Short Response", "Indicate activities, offices held in secondary school and years of participation (sports, student government, publications, music, theatre, civic groups, etc.)"]]], [497, [["Extracurricular Short Response", "Please briefly elaborate on one of your extracurricular activities or work experiences."], ["Why This College Essay", "Describe the attributes of a York education that make it a good fit for your future. You may also provide a personal example which demonstrates your commitment to planning, pursuing, and reaching your goals."]]], [498, [["Overcoming Challenges Essay", "Describe your educational achievements in the face of any challenging social, economic, or cultural circumstances that you have encountered:"], ["Diversity Essay", "At Grand Valley, we feel that a range of thoughtful perspectives is necessary for open inquiry, liberal education, and a healthy community. Please tell us what unique perspectives you will bring to our university:"], ["Additional Info Essay", "In a few paragraphs, please explain how your self-assessment affirms your decision to apply to the Meijer Honors College. In your description, please also address any factors we should consider with regard to your qualifications (e.g., if you do not meet the ACT and/or GPA expectations)."], ["Additional Info Essay", "A substantial sample of your best writing from a recent course. Preferably, this should include research."]]], [499, [["Why This College Short Response", "What about St. John’s interests you most?"], ["Personal and Family Identity Short Response", "Share with us any aspect of your personal or family story relevant to understanding who you are today or who you want to be in the future. "], ["Opportunity for Questions Short Response", "Do you have any questions about the college or your application? "], ["Great Books Essay", "Discuss a book that has particular significance for you. What makes this book great in your view? What effect does it have on what you think or how you think? "]]], [510, [["Why This College Short Response", "Why are you interested in attending Texas Lutheran University?"], ["Why This Major Short Response", "Discuss your reasons for pursuing the Major/Academic Program selected above."]]], [517, [["Overcoming Challenges Essay", "Describe a situation in which you came into contact with someone whose beliefs were different than your own. What did you learn from this experience and were your beliefs altered in any way?"], ["Roommate Short Response", "What fictional character would you choose as your college roommate and why?"]]], [525, [["Why This College Short Response", "In 1-2 sentences, please tell us why you are applying to UW."]]], [526, [["Additional Info Essay", "Please feel free to share any additional information that you feel may be helpful for us to know when reviewing your application for admission."]]], [541, [["Extracurricular Short Response", "Please briefly elaborate on one of your extracurricular activities or work experiences."]]], [544, [["Why This College Essay", "A brief personal essay helps us get to know you better. You are welcome to write and attach a statement describing your interest in enrolling at\n<br />Northwestern."]]], [546, [["Topic of Choice Essay", "Write an essay of no more than 650 words, using the prompt to inspire and structure your response. "]]], [549, [["Topic of Choice Essay", "Write an essay of no more than 650 words on the topic of your choice."]]], [559, [["Why This College Essay", "Explain your reasons for seeking admission to Montclair State University, including what you believe are your academic strengths and interests. Be sure to explain any situations that may have had an impact, either positively or negatively, on your academic record."], ["Adult Learner Applicants Essay", "Submit a Personal Statement that demonstrates what you have learned through formal education and/or life experiences."], ["School of Nursing Essay", "Please provide a brief personal statement describing why you wish to pursue a career in Nursing."], ["College of Arts Essay", "Please discuss why you wish to study your program of choice in the College of the Arts at Montclair State. Be sure to include highlights of your experience related to your chosen academic program and how those experiences have shaped your current career goals."]]], [560, [["Extracurricular Essay", "Please briefly elaborate on one of your extracurricular activities or work experiences"]]], [562, [["Favorite Food Short Response", "Favorite food"], ["Vacation Short Response", "Dream vacation destination"], ["Music Short Response", "Most played band/musician on your Spotify playlist"], ["Pets Short Response", "Tell us about your pets (what kind of animals, names, etc.)."], ["Candy Short Response", "Favorite candy"], ["Show Short Response", "Which TV show did you recently binge-watch?"], ["Select-A-Prompt", "Paul DeJong - MLB (St. Louis Cardinals)"], ["Select-A-Prompt", "Gabriella Devia-Allen - esports commentator and host (LeTigress)"], ["Select-A-Prompt", "Tricia Griffith - CEO (Progressive Insurance)"], ["Select-A-Prompt", "Keith Habersberger - internet personality (The Try Guys)"], ["Select-A-Prompt", "Jack Hartung - CFO (Chipotle)"], ["Select-A-Prompt", "Sean Hayes - actor (Will and Grace) and podcaster (SmartLess)"], ["Select-A-Prompt", "Brendan Hunt - actor (Ted Lasso)"], ["Select-A-Prompt", "Jane Lynch - actor (Glee) and host (Hollywood Game Night)"], ["Select-A-Prompt", "Laurie Metcalf - actor (Ladybird, The Conners)"], ["Select-A-Prompt", "Craig Robinson - actor (The Office)"]]], [564, [["Identity Essay", "Consider the following individual identity descriptors: creator, doer, explorer, change agent, seeker. Choose one of these descriptors that best encapsulates your core identity. Provide 2-3 concrete examples of how the descriptor you chose reflects your identity. How might this core identity translate into action as a scholar citizen at the College of Charleston? In what ways do you hope to develop your core identity during college?"], ["Why This College Essay", "Many students apply to the College of Charleston based on our location, size, reputation and the beauty of our campus (temperate year-round weather also comes up frequently). While these are all important considerations in choosing a college, why is the College of Charleston a particularly good match for you?"], ["Additional Info Essay", "If you have graduated early, taken a GAP semester/year or you are completing a post-graduate year, we require that you complete this essay so that you can explain your activities over that period. For everyone else, this essay is optional and should be used to make us aware of any anomalies or extenuating circumstances that you’d like us to consider when we review your application."]]], [568, [["Extracurricular Short Response", "Please briefly elaborate on one of your extracurricular activities or work experiences."]]], [570, [["Select-A-Prompt", "At Bennington, students don‘t just study; they‘re makers and doers who create original work on their own and in collaboration with others. Tell us about something you‘ve created that you‘re proud of. Why is it important to you? Alternatively, tell us something you look forward to creating when you get to college. (Optional: We‘d love to see your work if you‘d like to share it with us. You‘ll receive instructions for submitting your work after we process your application.)"], ["Select-A-Prompt", "What piece of media do you think we should all know about and what makes it interesting to you? Your recommendation can be a book, music, TV show, movie, game, magazine, podcast, or social media channel--any form of media, really, but don‘t forget to let us know why you recommend it."], ["Select-A-Prompt", "Each year, Bennington students spend six weeks participating in Field Work Term at sites around the world. What would you like to do during FWT? Describe an organization, business, individual, career field, or type of work that interests you and tell us what excites you about it."]]], [577, [["Why This Major Essay", "Discuss your reasons for pursuing the Academic Program selected above?"]]], [578, [["Overcoming Challenges Essay", "Tell us your story. What unique opportunities or challenges have you experienced throughout your high school career that have shaped who you are today?"], ["Additional Info Essay", "Most students have an identity, an interest, or a talent that defines them in an essential way. Tell us about yourself."], ["Ticket in Hand Essay", "You‘ve got a ticket in your hand - Where will you go? What will you do? What will happen when you get there?"]]], [583, [["Additional Info Essay", "The “Tell us More” essay is an opportunity for you to describe any special circumstances that created challenges or opportunities for you while in high school, and what you learned from those experiences."]]], [589, [["Extracurricular Short Response", "Please briefly elaborate on one of your extracurricular activities or work experiences."], ["Diversity Short Response", "As part of our mission to provide students with a liberal arts education, Georgia College strives to create an atmosphere that instills in students exceptional qualities of mind and character including respect for human diversity and individuality. Given your own individual background, life experiences, and personal identity, how will you contribute to the overall diversity of the student body at GC?"], ["Why This College Short Response", "Georgia College is dedicated to extending learning beyond the classroom to foster critical thinking skills and help students develop the tools necessary to not only consume knowledge, but also produce knowledge. Our faculty create a rigorous and challenging classroom experience, and prepare students to combine that experience with real-world applications. With this educational style in mind, please describe the most important goal you have established for yourself regarding your future undergraduate experience and explain how a Georgia College education fits into accomplishing this goal."]]], [611, [["Why This College Essay", "At Seattle Pacific, we encourage all students to explore or go deeper in Christian faith and to be inspired to make a difference. SPU’s vision means that you can pursue an education that helps you change the world for the better. How does Seattle Pacific’s vision align with your desires for college? How does your own faith perspective or personal story intersect with our vision?"], ["Additional Info Essay", "Please explain your decision to apply without test scores."]]], [621, [["Additional Info Short Response", "Please explain any gaps in your education after high school."]]], [628, [["Select-A-Prompt", "Describe a meaningful event, experience or accomplishment in your life and how it will impact your college experience and your contribution to the UNCG community. Consider reflecting on your ideas about student responsibility, academic integrity, campus citizenship, or a call to service.\n"], ["Select-A-Prompt", "Explain your choice of academic major and how you plan to use your degree to meet your career goals?"], ["Select-A-Prompt", "What does \"global citizenship\" mean to you? How do you envision becoming a global citizen through your studies in your future career?"]]], [639, [["Diversity Short Response", "What sets you apart from other students applying to Regis College?"]]], [646, [["Personal Goals Essay", "What does college success mean to you?"]]], [650, [["Additional Info Short Response", "How did you learn about MMA?"]]], [660, [["Why This College Short Response", "How does Pacific University fit into your educational and long-term goals?"]]], [669, [["Why This College Short Response", "Why are you interested in Flagler College?"], ["Why This Major Short Response", "Discuss your reasons for pursuing the selected academic program?"]]], [672, [["Extracurricular Short Response", "Please briefly elaborate on one of your extracurricular activities or work experiences."], ["Why This College Short Response", "How did you first become familiar with St. Edward‘s University, and why are you applying for admission?"]]], [673, [["Why This College Essay", "Why do you want to attend High Point University? "], ["Select-A-Prompt", "Describe any special interests or hobbies that you may have."], ["Select-A-Prompt", "Describe any meaningful travel experiences (both national and international). "]]], [674, [["Additional Info Short Response", "Is there additional information you would like to share related to your application? For example, if you have any D or F grades, or are not satisfied with your ACT/SAT test scores, this is your opportunity to explain. It is helpful if your response includes what factors contributed to your performance and what actions you took to help yourself become more successful."]]], [684, [["Extracurricular Short Response", "Optional Brief Statement - Extracurricular Activity or Work Experience"]]], [694, [["Select-A-Prompt", "Write a one to two-page essay in which you explain how Dana Gioia builds an argument to persuade his audience that the decline of reading in America will have a negative effect on society. In your essay, analyze how Gioia uses one or more of the features in the directions that precede the passage (or features of your own choice) to strengthen the logic and persuasiveness of his argument. Be sure that your analysis focuses on the most relevant features of the passage. Your essay should not explain whether you agree with Gioia’s claims, but rather explain how Gioia builds an argument to persuade his audience."], ["Select-A-Prompt", "In this essay, Gioia states that “(a)dvanced literacy is a specific intellectual skill and social habit that depends on a great many educational, cultural, and economic factors.” Write a one to two-page essay in which you address how two of these categories (education, culture, and economics) have affected your literacy skills. For instance, you might consider how your family’s financial situation has impacted your ability to access literary opportunities. Or perhaps how a cultural practice such as oral storytelling or routine memorization of religious texts has made you\n<br />more literate.\n"]]], [702, [["Why This College Essay", "What do you consider to be the most significant factor in your decision to apply to MSU?"]]], [713, [["Why This College Short Response", "At RWU, the Honors First Year Experience is an essential part of the Honors Program. Please describe what you hope to gain from this collaborative, interdisciplinary learning environment."], ["Diversity Short Response", "Please describe a specific anecdote that exemplifies who you are and/or something you will bring to the RWU Honors Program community."], ["Community Service Short Response", "What does being a global citizen mean to you? What are some ways that you can be globally engaged within your own local community?"], ["Extracurricular Short Response", "Please briefly elaborate on one of your extracurricular activities or work experiences."]]], [741, [["Personal Goal Essay", "Describe a goal that you have set for yourself that you may or may not have yet achieved. Include examples that demonstrate your work ethic toward achieving this goal, how long you have been working towards this goal, and whether your efforts thus far have been successful."], ["Extracurricular Short Response", "Please briefly elaborate on one of your extracurricular activities or work experiences."]]], [753, [["Why This College Essay", "With test scores being optional, a personal statement and list of achievements will help to strengthen your application when it is reviewed by the Admissions Committee. If you would like to tell us more about yourself, please do so here. Your personal statement could answer one of the following example questions: Why do you want to attend UH Mānoa? How does UH Mānoa fit into your career goals?"]]], [761, [["Overcoming Challenges Short Response", "Tell us about your academic and personal achievements. What have you learned from your successes and/or challenges, and how will this influence you as you pursue your college education?"]]], [777, [["Why This College Essay", "Why are you interested in UAF?"]]], [794, [["Overcoming Challenges Essay", "Compose an essay of 400-500 words on the following topic: Reflect on a time when you challenged a belief or idea. What prompted you to act? Would you make the same decision again?"]]], [803, [["Why This College Short Response", "What was the most important factor in choosing to apply to George Fox University?"]]], [816, [["Overcoming Challenges Essay", "Tell us your story. What unique opportunities or challenges have you experienced throughout your high school career that have shaped who you are today?"]]], [884, [["Criminal Activity Short Response", "Have you ever been convicted of any offense other than a minor traffic offense?"], ["Criminal Activity Short Response", "Have you ever been suspended for academic deficiencies from an educational institution or from a particular program of study?"]]], [894, [["Community Service Essay", "In 250-500 words, why do you desire a faith-based education, and how will your education prepare you to take on the challenges in your community?"]]], [896, [["Faith Short Response", "Please briefly (in 300 words or so) describe how you became a Christian and how you‘re involved in both your church and your community."]]], [900, [["Why This College Short Response", "Why are you interested in attending Worcester State University?"]]], [925, [["Extracurricular Short Response", "Please briefly elaborate on one of your extracurricular activities or work experiences."]]], [951, [["Diversity Essay", "UB Honors scholars are characterized by intellectual curiosity, a broad range of interests, and a commitment to a diverse and inclusive society. What experiences have helped to broaden your perspectives academically, socially and culturally? What experiences do you hope to have that will enlarge your understanding of the cultural richness of America and the world? Please be as specific as possible in your answer."]]], [964, [["Extracurricular Essay", "Please briefly elaborate on one of your extracurricular activities or work experiences."]]], [1007, [["Why This College Essay", "Why do you want to be part of the Honors Program? Why is academic excellence important to you? "]]], [1020, [["Why This Major Essay", "Tell us more about what you’d like to study in college and why. Remember, at Antioch College, we don’t offer traditional majors in that all students complete a Self-Designed Major. You will design your major around one or more areas of study with the help of the faculty. Students declare their majors in the second year, but it’s important that we have an idea what you believe you’d like your major to be so that we can best support you. If you are unsure at this point, tell us about the academic subjects that most interest you."], ["Why This College Essay", "What aspects of the Antioch College experience prompted you to apply? Here, we are asking you to talk about specifics in the curriculum, faculty, campus life, or Co-op that most resonate with you. Base your answer on something you’ve read, a conversation you’ve had with an admissions counselor, or other research you’ve done about Antioch College."], ["Occupational Dreams Essay", "Antioch College is a Cooperative Education (Co-op) school, which means you will complete at least three field experiences by the time you graduate. Co-ops are typically full-time, compensated work placements, but they can also be research appointments, independent work or learning, or other experience-based opportunities. Tell us about the kinds of Co-op experiences you are most looking forward to. You can name specific jobs or internships, employers, or general settings."]]], [1029, [["Extracurricular Essay", "Please briefly elaborate on one of your extracurricular activities or work experiences."]]], [1036, [["Why This College Short Response", "Please provide a short personal statement that outlines your goals for your enrollment at Columbia College Chicago. You may choose to write about development of your creative practice, progress toward your career objectives, improving specific skills, or your own personal growth."]]], [1039, [["Meaningful Piece of Writing Essay", "Please send a 400- 500 word essay describing a piece of writing (book, article, blog) and how it has impacted the way you think about yourself or the world. "]]], [1073, [["Select-A-Prompt", "What is the hardest part of being a teenager or young adult today?"], ["Select-A-Prompt", "What matters to you, and why?"], ["Select-A-Prompt", "How do you plan to positively impact society with your degree from Morgan State University?"]]], [1078, [["Why This College Essay", "In a few sentences, briefly describe what attracts you to Trinity and why you desire to be part of our Christ-centered community:"], ["Additional Info Essay", "How does your faith in Jesus Christ shape your life?"]]], [1079, [["Extracurricular Short Response", "Please briefly elaborate on one of your extracurricular activities or work experiences."]]], [1088, [["Why This College Essay", "Why are you interested in Lasell University?"]]], [1146, [["Extracurricular Short Response", "Please briefly elaborate on one of your extracurricular activities or work experiences."], ["Why This College Short Response", "Why are you interested in Coastal Carolina University?"], ["Additional Info Essay", "If you have been separated from high school or college for more than six months or one term, please explain how you have been using your time."]]], [1154, [["Extracurricular Essay", "Please briefly elaborate on one of your extracurricular activities or work experiences."]]], [1186, [["Responsibilities Essay", "Who in your life is depending on you? What are they depending on you for?"], ["Goals Essay", "What are your goals for the future and how can Utica College assist you in reaching them?"], ["Why This Major Essay", "Discuss your reasons for pursuing your major of interest."]]], [1216, [["Overcoming Challenges Short Response", "Describe how your high school transcript or test scores are, or are not, an accurate reflection of your potential for intellectual growth."], ["Additional Info Essay", "Is there something you would like to tell us about yourself? Please enclose a separate sheet of paper.\n"], ["About You Short Response", "Tell us your favorite:\n<br />a. Book \n<br />b. Movie \n<br />c. Academic Subject \n<br />d. Saying/Expression"], ["Extracurricular Essay", "Please tell us how you have spent the last two summers, including any jobs you have held."], ["Favorite Books Short Response", "List by Author and title, books you enjoyed most in the past year, indicating with an asterisk (*) the readings that were not required for class."], ["Extracurricular Essay", "List activities/clubs/organizations in which you’ve participated, noting any leadership roles."], ["Community Service Essay", "Identify the most meaningful school or community activity in which you’ve participated. How did your participation impact others in your school or community?\n"], ["Community Service Essay", "List service/volunteer experiences."], ["Why This College Short Response", "What, specifically, motivated you to apply to the Cook Honors College and what do you hope to learn in an honors environment?"], ["Select-A-Prompt", "If you could stop one invention from being invented, what would it be and why?"], ["Select-A-Prompt", "Write about a moment that illustrated your shift from child to adult in your family or community.\n"], ["Select-A-Prompt", "What book, artwork, film, or music has changed the way you think about the world? How so?"], ["Select-A-Prompt", "Some students have a background, identity, interest, talent or challenge that is so meaningful they believe their application would be incomplete without it. If this sounds like you, then please share your story."], ["Select-A-Prompt", "Think about someone you routinely see but never notice. Reflect on why you think this is. How might this newfound awareness change you?\n"], ["Select-A-Prompt", "Choose a controversial rule or law (local, state, federal) and explain your position on it."], ["Select-A-Prompt", "Some say social media is superficial with no room for expressing deep or complex ideas. We challenge you to defy these skeptics by describing yourself as fully and accurately as possible in the 280-character limit of a tweet. Use the rest of your word count to reflect upon this challenge."]]], [1324, [["Passion Essay", "Describe a topic, activity, idea, or concept you find so engaging that it makes you lose all track of time. How did you come to develop this interest? What is the experience like when you are engaged with it? Why does it captivate you? What or who do you turn to when you want to learn more? What can we learn about you from this interest or passion?"], ["Additional Info Essay", "If you would like, please let us know anything else you would like the faculty to consider as they read your application (life circumstances, extracurricular activities, etc). This is purely optional and applicants who do not choose to add additional information will not be affected."], ["Select-A-Prompt", "In her essay, “Peculiar Benefits,” the African American writer Roxane Gay writes the following: “Privilege is a right or immunity granted as a peculiar benefit, advantage, or favor. There is racial privilege, gender (and identity) privilege, heterosexual privilege, economic privilege, able-bodied privilege, educational privilege, religious privilege and the list goes on and on. At some point, you have to surrender to the kinds of privilege you hold because everyone has something someone else doesn’t . . . . Privilege is relative and contextual. Few people in this world, and particularly in the United States, have no privilege at all. Among those of us who participate in intellectual communities, privilege runs rampant. We have disposable time and the ability to access the Internet regularly. We have the freedom to express our opinions without the threat of retaliation. We have smart phones and iProducts and desktops and laptops. If you are reading this essay, you have some kind of privilege. It may be hard to hear that, I know, but if you cannot recognize your privilege, you have a lot of work to do; get started.”"], ["Select-A-Prompt", "In the introduction to his book The Lies that Bind: Rethinking Identity the philosopher Kwame Anthony Appiah states: \"There’s no dispensing with identities, but we need to understand them better if we can hope to reconfigure them, and free ourselves from mistakes about them that are often a couple of hundred years old. Much of what is dangerous about them has to do with the way identities—religion, nation, race, class, and culture—divide us and set us against one another. They can be the enemies of human solidarity, the sources of war, horsemen of a score of apocalypses from apartheid to genocide. Yet these errors are also central to the way identities unite us today. We need to reform them because, at their best, they make it possible for groups, large and small, to do things together. They are the lies that bind.\""]]], [1374, [["Why This College Essay", "How has your experience prepared you to attend The Evergreen State College?"]]], [1490, [["Additional Info Essay", "The personal essay offers an opportunity for the admissions staff to become better acquainted with you in ways different from courses, grades, test scores and other objective data. It also offers you an opportunity to demonstrate your ability to organize thoughts and express yourself. Please note that this essay will be evaluated for your admission to Bennett College for Women."]]]]